{
  "540": "POVODNEVO, Tver governorship village in the county of the city Bezhetsk. There is an annual fair on September 14; come to the judges with petty merchants Lavochne item.",
  "289": "KINEShMA, the city of the same governorship. There is an annual fair on the Exaltation of the Cross September 14 to 25 the number; the judges at the fair came merchants from Moscow, Yaroslavl, Kostroma, Nizhny Novagoroda, and brought to the sale of cloth, different silk fabrics, silver and pewter, and all sorts of petty goods, and fish and vegetables.",
  "119": "VOLSK, the city of Saratov governorship. It besides weekly bargain bread and so on. Congress is June 28 peasants.",
  "752": "TSYVILSK, from 1781, the city of Kazan governorship. In the hold there twice a year, the fair for the first time on June 26, the second on July 20; petty trading different commodities.",
  "733": "khalcha, town of Mogilev governorship in Belitsk County. It is a fair of the year.",
  "565": "PUDOGA or Pudozhsky city Olonets region. There is an annual fair on December 6th day; Sales are made Lavochne goods, but most of the soft stuff, for which come from different merchants Russian cities, including St. Petersburg from.",
  "472": "NEW OSKOL, the city of Kursk governorship. It is one in a year on the day of the fair Paraskeva, named Friday in the outcome of the October Revolution lasted one day.",
  "311": "Kozlov, the city of Tambov governorship. There are two fairs a year: August 15 and September 14 th; on the add two days of trading ordinary peasant goods, and of visiting merchants do not happen.",
  "685": "Teryaeva, the village of Moscow Province in the Ruza district. It is an annual fair on the day of the Holy Prophet Elijah.",
  "471": "NEW MYRHOROD city Yekaterinoslav region. In the case in the hold, four fairs.",
  "754": "CHAPEL ST. SPIRIT, the same governorship and counties. When thereof is fair in the month of June. Merchants come from Pskov with different petty goods.",
  "424": "MEHONSKOY, jail Ufa governorship in Chelyabinsk district. There is fair on December 25 and 20 July; petty trade in goods.",
  "367": "LADA, a village in the Ryazan governorship Zarajsky County. There is an annual fair on July 8th Day; bring on the judges petty merchants different silk goods.",
  "708": "Turku, Penza governorship village in the county of the city of Kerensky. Here byvaetv year's fair in July, which come from nearby cities with different petty goods; traded as horses, cattle, and other things.",
  "492": "OLYSHANAYA, settlement in the county of the city of Kharkiv. There are fair on Palm Sunday, on Whit week, September 8, October 26; petty merchants traded commodity, wine, beer, honey and other things.",
  "662": "ANGLE elders, or KOGUEVA, desert Simbirsk governorship in Alatyrskom County. There is fair on the day of the Transfiguration of the Lord; at the fair come from all sorts of silk and other goods from Moscow and other cities of the merchants, and peasants takozh.",
  "673": "Syzran, since 1780, the city Sinbirskogo governorship. Here is the Congress July 8 the number of peasants with bread, with horned and small cattle, victuals and other petty commodities.",
  "603": "boot, since 1778, the city of Ryazan governorship. There is fair on the tenth Friday, July 8; Items brought to the judges of the various cities and counties merchants, silk, paper and red Pisnoy, crosses, perstyani needles, pins, linen, flax and hemp oil, etc. to podovnoe; and townsfolk sell wooden utensils, and other sorts hlbom.",
  "129": "CHOICE, a suburb of the same governorship. There are annual fairs: the first day of Pentecost, the second day of the Assumption of the Virgin, the third day of the Exaltation. On these should come Toropetskiy merchants with petty commodity.",
  "791": "Yurievets POVOLGSKY, from the same year, the city of Kostroma governorship. Here come the peasants on Monday and Thursday of goods brought bread and food, and with different woods, hay and pots.",
  "465": "NELYANSKOY, iron plant in Yekaterinburg, Perm governorship County. Here is the day of the Holy Apostles Peter and Paul deliberate Fair prodolzhayuschayasya few days which attracts a lot of merchants from near lying cities, namely: Ekaterinburg, Verkhoturye, Turinsk, Tyumen, which, like the local inhabitants, various Russian, Siberian and Chinese goods trade .",
  "74": "bronnitsy, pits Novogorodskogo governorship and counties. There is a year to Congress on June 24 trade days.",
  "656": "Old Ryazan, Ryazan settlement governorship. In the case thereof, of the day on June 29 for the annual fair of the peasants.",
  "359": "Kubensky, village and county Vologda Viceroyalty. There is bargaining ezhenedel tion by Th dwarfs.",
  "674": "Sevsk, since 1778, the city of Oryol governorship. In the hold is in year one fair, excluding ordinary trading.",
  "480": "Oberoi - Palen, Noble Manor Riga governorship in Tartu County. Here is one in a year's fair.",
  "34": "farm laborers, rural Sinbirskogo governorship below the city of Syzran. In it, from 29 June to 12 July is the annual fair, which brought a lot of Ural Especially fish and caviar.",
  "369": "NEW Ladoga, St. Petersburg Province town. There is only once a year on August 15th Fair, which lasts a week, where they sell various Russian and overseas goods, edible takozh peasant supplies for this very built there living yard circle in ste osmidesyati yards, which is considered to be sixty-nine stores.",
  "188": "Derkul, Sloboda, Voronezh governorship in the county town Valuek. In the settlement thereof is in year three fairs.",
  "744": "Wish, the village of Kharkov governorship in Sumy district. In the hold of the year there are three fairs; which come from the petty merchants of goods and hot wine.",
  "51": "Rich, the city of Kursk governorship. It happens every week on Mondays and Fridays trading.",
  "279": "Karpivka, Arkhangelsk tozh, a village in the Ryazan governorship Donkovskom County. There are two fairs a year: the first day of the Archangel Michael on November 8, the second day of Nicholas the Wonderworker, December 6; here come the merchants and peasants with different petty goods.",
  "585": "ROPSK, place Novogorodskogo - Seversky governorship in Starodubovskom County. In the hold is in year three fairs that come from places devious merchants with red and other petty commodities, as there are also weekly Torzhok.",
  "88": "Cyril Belozersky Monastery, the same governorship in Belozersky district. When the hold there are three annual fairs: the first on June 9, called Kirilovskaya, the second on August 15, the Assumption, the third November 21, Vedenskaya; here come from different Russian cities merchants with a variety of goods.",
  "401": "LYAUDERA, place Polotskogo governorship in the county town Dinaburga. In this place there are two fairs a year; Riga door peddling petty peasants different goods, wine and Liv.",
  "489": "OLISHEVKA, town in the district of Kiev. Here is the year two fairs; buy add-on visiting merchants leather, sheepskin, fur coats, salt and so on.",
  "255": "raisins, city of Kharkov governorship. In this city, there are four fairs a year: in the first month of Maie cutting off the day, the second on June 24, the day of the Nativity of St. John the Baptist, the third on September 14, the day of the Exaltation of the Holy Cross, the fourth October 26, the day of the Great Martyr Demetrius; to discharge the same merchants come from different cities with silk, cotton, wool and other goods.",
  "98": "Barco, a place Polotskogo governorship in Dinaburgsky County. In this place there in the year two fairs; Riga Palace peasants sell various petty goods, wine and beer.",
  "293": "KIRSANOV, the city of Tambov governorship. There are two fairs a year: one in the first day of fasting Petrova, and the other day on July 20, which come from nearby towns with petty commodity.",
  "316": "KOLYUPANOVKA, Tula village governorship 7 miles from Alexina. There is Fair July 8 numbers, which come from Alexina merchants with small farmers for commodities.",
  "160": "GOLTVA, the city of the same governorship. In the hold is in year four fairs: the first of January, 6, and the other on July 29, the third on August 6, the fourth November 8; traded on the add immigrants from different county residents petty goods there Rodia, kak some bread, hot wine, various cattle, tar, sheepskins, skins and other things; sometimes come and Great Russian merchants with red merchandise.",
  "7": "Axel village of Tambov governorship in Temnikov County. There is an annual fair, over the weekly auctions, eleven Friday after Easter; merchants here come from nearby cities with silk and paper products, bread and other supplies.",
  "204": "Dubrovnaya, town of Mogilev governorship. There is a three-year fair.",
  "446": "Footbridge, place Yekaterinoslav region. In the hold is in year three fairs.",
  "194": "Kind, Sloboda, Voronezh governorship. In this suburb of the year there are three smaller fairs: the first 9 May the second on June 26, the third on December 6th, and last no more than one or two days. Merchants on these should bring petty goods.",
  "281": "China, jail in Yekaterinburg mining department. Here napred visited this great fair on the day of the Epiphany, which attracts many merchants from Siberia and from Russia, and especially the Kazan through Ufa at what was then a great way from Kazan to Siberia was through and through Ufa thereof Kataysk jail; but with the construction of Ekaterinburg sion Kataysk Fair cut short by what is already a great way laid through this city.",
  "441": "Molokova, a village in the Tver governorship Bezhetsky County. There is an annual fair; sell bread, cattle, hides and tallow.",
  "510": "Pavlova, a village in the Moscow Province Bogorodsky district. In one, for there are over in winter vsyanuyu week on Monday trading bread, sometimes a year Fair Oct. 26 days, at which visiting different cities merchants brought cloth, silk, and all the villagers for the right products, and the people here are selling are manufactured silk scarves of different hands, dyed and edibles.",
  "11": "Alexina, the city of Tula governorship. There are two fairs a year: On July 1, the second day of August 29th. On these should come with different moskotilnymi goods.",
  "729": "Fellini, since 1783, the city of Riga governorship. There is a fair one year for a week Mikhailov days, and that is not important, but almost to the peasantry; about living nobles gather more in Revel, Pernove and Dorpat.",
  "586": "height, the city of Yaroslavl governorship. It happens here yearly fair team in the second week of Lent; come here from other cities merchants with various Russian and German goods, furs and other things from Yaroslavl, Pereyaslavl Zaleski, Moscow and Vologda different surovski of silk goods, and from Yaroslavl and silvering yes from Kineshma with about roses, from the village Makarov and Purekh with wooden utensils, from Murom and Kasimovsky counties with the rims of Poshehonsky and Ustiug counties with separate iron, that is, boilers, pans, nails, locks, way of life and other iron goods, and trade within the city in the ranks in the shops, and others in tents.",
  "473": "NEW Mlyn town Chernigov governorship in the county of the city of Nezhin. There is a four-year fair: the first of January, 6, the second on April 23, the third 29 June, the fourth on September 8. These should come to the merchants of the Great Russian and Little Russian cities with different petty goods; zhitelizh sell bread, fish, salt and other Crimean.",
  "721": "estuary, the village by the river Vologda Viceroyalty Kubenitse, 50 miles. Here in the winter weekly on Fridays going devious villagers, and people here are sold to merchants skin beef and lamb, fat, meat, big and fat pig, cow butter, bristle koshechi and rabbit skins. In the same village Especially seed is fair, called Ivanovo Zaozerskaya, which are notonly Vologda, and Moscow, and Ustiug Totemskie merchants to purchase paintings, canvas, cloth sermyazhnyh, resin, rock and so on. and sell a row for a week, that is from 17 June to 23 numbers.",
  "589": "Ruza, the city of Moscow Province. In the hold of the year there are two fairs: the first on June 29, the second on the Cheese week on Thursday and continue for one day; petty trading different commodities.",
  "395": "LEFT Lamkov, Tambov governorship village in the county town of Kozlov. There is one annual fair on July 8, the feast day of Our Lady of Kazan. At the judges come from different merchants surrounding petty goods.",
  "518": "Perevolochnaya, place Yekaterinoslav region. In the hold is in year two fairs.",
  "394": "Lgov, Kursk governorship. In nem except weekly speculations are in year two fairs: one in St. John's Day on June 24, the second of September 1, lasting two or three days that Kursk, Sevsk of Rila and merchants brought cloth, silk different matter and small things ; also quite fit in there with plants horses.",
  "117": "Volokolamsk, the city of Moscow Province and the province. In the hold is annual 29 June Day Fair. Come from different cities and counties with different peasant and scrupulous small wares, and bread, plows, scythes, sickles and so on. beyond this in the county thereof Torzhok are weekly: 1) in the village Yaropolche in heels, 2) in the village Ivashkova Saturday, h) in the village of Sereda Stratilatovskoy in mid. Annual fair go, 1) in the village Yaropolche the tenth Friday, 2) in the village of Sereda Stratilatovskoy June 8 days, 3) have Levkieva monastery August 15 days, 4) Joseph Monastery in the day of Pentecost and September 8 days, 5) in the village Berkunove in the ninth putnitsu, 6) in the village of White Colpi August 19 days, 7) in the village Ramenye June day, 8) in the village Cherlyankove May 9 days, 9) in the village Hovanov July 20 days, 10) in the village Murikove September 25 days, 11 ) in the village Snirove Nov. 21 days. On these fairs are trading one day different peasant goods.",
  "209": "DEDILOV, Sloboda Tula governorship in Belevsky County. There is fair on July 5 and 16 numbers; come to the judges from nearby cities with petty goods for the peasantry.",
  "237": "kites, suburb of Kharkov governorship in the county town of raisins. In thereof are in year three fairs: the first on June 29, the day of St. Peter and Paul, the second on September 1, the day of Simeon, the third on October 14, on the day of Paraskeva. Merchants come to discharge the same from different Russian cities with silk, wool, paper and other goods.",
  "208": "Dushatin, place Novogorodskogo - Seversky governorship in Starodubovskom County. In the hold is over Torzhok weekly fair, where city dwellers come Mglin and petty trading different commodities.",
  "220": "ERAHTURA, a village in the Ryazan governorship Kasimovsky County. Here is one in a year's fair on June 29, over kazhdonedelnogo bargaining, it happens on Fridays.",
  "66": "Borisoglebsk monastery Yaroslavl governorship in Petrovsky district. When it happens on May 2 of the annual fair, where visitors from different cities devious merchants traded surovskimi goods.",
  "753": "The Chapel of St. Thomas, which belongs to the Palace of the Pskov governorship townships in the county town of the island. When thereof is fair in the month of April; merchants come from near lying cities with inexpensive goods.",
  "390": "Luzhkov, Moscow Province village in the Ruza district. There is an annual fair on May 9 numbers; petty trading different commodities.",
  "768": "Cherneev Mykolaiv, Monastery, Tambov governorship in the county town of Shatsky. There is a year Fair on May 9; different internal trade in goods, canvas, hemp, wool and other.",
  "683": "Teplogorsk Bogoroditskaya, desert Vologda Viceroyalty County Ustiug Great. There is a year one fair, where merchants come from different cities for the most part with petty goods.",
  "352": "Krivtsov, village and county Yaroslavl governorship. Here is the annual St. Nicholas Fair December 5 day; farmers bring and sell lard, butter, geese, and sheep skin raw; Kupetsky same people with any goods does not arrive.",
  "712": "UDD river Irkutsk governorship. Up the river when it is Anya Congress in August, September and October; buy here at the mass merchants and infidels all soft stuff for money.",
  "206": "DUNILOVO, village Vladimerkogo governorship in Suzdal district. There is fair on October 1; merchants come from different cities with petty goods.",
  "374": "LAPSTRAND Kirk governorship and Vyborg district. Here is the autumn fair in the month of September; on the judges come Neyshlotskogo and Vyborg districts of picks Chukhno with resin, oil, lard and cattle.",
  "115": "Volmar, the city of Riga governorship. It is fair on the day of St. Anne, continuing with two days on which and foreign merchants come with goods not in large quantities.",
  "672": "breadcrumbs, place the Mogilev district governorship in Chauskoy. Here is one in a year's fair.",
  "537": "Ples town of the same governorship. There are fairs Peter and St. Basil once a year; goods brought moskotilnye and other petty.",
  "761": "Cherikov, from 1779, the city of Mogilev governorship. Here is the year two fairs sold cattle, horses, salt and other.",
  "170": "TOWN, a village in the Moscow Province Mozhaisk district. There is every year the fair on June 28 days.",
  "632": "SINBIRSK, 1782 with the main town of this name governorship. In it, besides the daily trading Especially, there July 5 to 8, the number of annual fair.",
  "122": "freestyle, suburb of Kharkov governorship in the Belgorod district. In thereof are annual fairs: the first on February 2, the day of the Presentation of the Lord, and the second on May 9, the day of Nicholas the Wonderworker, the third in the tenth Friday, August 15 the fourth day, the day of the Assumption. These should come to the merchants from. near lying cities; trade cloth, silk, paper and naboychatymi goods, linen, iron, dishes and stuff.",
  "272": "Kamenetz, a place Polotskogo governorship in the county town Dinaburga. In the family. place there are three fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "478": "NUROMSKOY, Monastery Vologda Viceroyalty and counties. There is Fair August 1 numbers on kotoroypokupka and sales are different moskotilnyh and other petty peasants priugotovleniya goods, as - that garden, canvas, and other Myakotina.",
  "159": "Gogol, town and county of Kiev governorship. There is a year of burning fairs; these should come to the merchants of the cities roundabout, sell bread, various petty commodity, fishes, salt, cattle and other things.",
  "604": "Saransk, since 1780, the city of Penza governorship. In this city, there is Fair August 16, which is brought from different cities of petty merchants and other goods; auction proceeds of up to seven days.",
  "638": "SLOLTSA wheeled settlement Pskov governorship in the county town of Porkhov. Here is July 20, fair; on the judges come from Novagoroda and from Old Rouses merchants with different silk petty goods.",
  "709": "Toohey, a village in the Kiev governorship Myrgorod County. In the case in the hold, one Congress of Trade, consisting of county residents, petty trading different commodities, there Rodia and do, kak some bread, hot wine, various cattle, sheepskins, skins and so on. Sometimes the Great Russian merchants and come with a red item.",
  "434": "Mikhailovka place Kiev Viceroyalty eye lo Yabluneva same town. In the hold is in year five fairs, which merchants come with a variety of goods",
  "779": "SHESHKEEV, since 1780, the city of Penza governorship. In the hold is annual Fair on May 24.",
  "595": "REZYTSY city Polotskogo governorship. In this city, there are two fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "250": "Ivanovo, trench Yekaterinoslav region. In the hold there are two fairs a year.",
  "735": "HATOML, settlement in the county of the city of Kharkiv. There are fairs: February 2, March 25, May 9, June 14, July 27, September 1, October 26, December 6; petty merchants traded goods, wine, beer, honey and other things.",
  "550": "Poltava city Yekaterinoslav region. In the case in the hold, four fairs: the first in a solid week, the second on May 9, Nicholas, the third on July 20, Elias, fourth September 14th, Exaltation of the Cross. These should come to the Great Russian, Little Russian and foreign, from Poland, Silesia, Gdansk, King - Castle and from the entire region of the Turkish merchants and industrialists with all sorts of noble and petty goods. The merchants of this city sends all shared in the same place they Rodia and the county Products like - then cattle, oil, and other horses, canvas, ropes and various kinds of fur products. At the weekly auction going to the city county residents thereof, and the Russian trading products.",
  "302": "the Princess, the city of Nizhny Novgorod governorship. It happens every week on Tuesdays bargaining, where farmers bring all sorts of food, and wood and tar.",
  "582": "ROLOVSKOE, village Yaroslavl governorship. There are two annual fairs, namely one Vasilyevskaya, of January, the number 1 and the other Ivanovo, June 24 numbers; in those fair Kupetsky people with any goods do not come and buy from farmers considerable number of canvases.",
  "468": "Nerehta, the city of Kostroma governorship. Here are the year Fair May 2, June 23 and July 24 numbers; and moreover every week on Monday brought the canvas, yarns, linen, cotton material, calico, vyboyki and other petty commodities.",
  "549": "POLOTSK, the main town of this name governorship. There are four fairs a year: the first on the Epiphany, the second in the first week of Lent, the third in a five day before Petrov, the fourth a week before Christmas. On the add torguyutlnom, hemp, forests, bread, honey, wax, potash and cattle.",
  "445": "Mosalsk, the city of Kaluga governorship. There are three fairs a year: April 23, July 8 and November 26, lasting only one day.",
  "294": "Kister, village Novogorodskogo - Seversky governorship in Starodubovskom County. In the hold there kazhdonedelnye Torzhok, which attracts residents devious and petty trade in goods.",
  "231": "Zaraisky, the city of Ryazan governorship. In this city, there are three annual fairs: May 9, during the feast of Pentecost, but on July 28 numbers. Some county townsfolk come with different bread and village handicraft, with corrupt horses and horned for beast; and from Tula, Venev and Kashira merchants come with braids, Kolomna same with clamps, bars, and other penechnymi twine.",
  "164": "Gorizia, a village in the Tver governorship Kashinskaya County. In the hold of Torzhok there for the whole week on Sundays; goods imported from county linen canvases are different, from the city of Yaroslavl, Uglich Pereslavl Zaleski and merchants come from all sorts of petty commodities rather poor.",
  "321": "Konstantinova, place in Kiev Viceroyalty Lubenskiy County. In the hold is in year three fairs: the first day of the Descent of the Holy Spirit, the other on the day of the Assumption of the Blessed Virgin Mary.",
  "306": "KOVYMSKOE or Kolyma, cabin top, middle and bottom in Siberia. In the add are fair in February and March.",
  "226": "Zhizdra, the city of Kaluga governorship. It is September 25th annual fair, which come from the cities of devious merchants with silk, paper and moskotilnymi goods.",
  "546": "Pokrovsky, Kazan governorship Ekonomicheskoe village in the county town Kozmodemjansk. Here is one in a year's fair, which lasts no more than four days, and on which different silk trade and other petty commodities.",
  "12": "Alekseyevka settlement Count Sheremetev in Voronezh governorship about the settlement same zeal. There is a year four fairs: the first day Alexis Man of God, the second week of the Trinity, the third in the Exaltation of the Cross, the fourth day of the holy martyrs Cosmas and Damian Nov. 1 day; Foreign merchants did not happen, and come with various Russian goods.",
  "333": "Kochelaevo, village Penza governorship in Narovchatovskom County. There is a fair one year in the month of June the tenth Friday in different numbers, but for the most part thereof are to peasants.",
  "628": "Serpeysk, since 1777, the city of Kaluga governorship. There is one annual fair in the tenth Friday after Easter, but the county thereof city has osmium tahih villages, who come in once a year for a bargain, while the church in those villages holidays.",
  "152": "GLEMYAZOV, place in Kiev Viceroyalty Pereiaslavl County. In the case in the hold, four fairs: the first on Cheese week, cutting off the second day, the third day of the Transfiguration, the fourth day of the Introduction. The merchants of these should come to the near lying cities with red Kramnoy and other goods, with glass and wooden utensils, with small village of Don fishes; residents sell cattle, horses, bread, tar, hot wine and other; also brought here for sale to residents Crimean salt.",
  "710": "TYURTEN, Village Orlovsky governorship in Eletsky County. Here is July 8 day fair; trade Elets merchants and other cities with county townsfolk all sorts of different petty goods and tar; and the townsfolk sold to merchants and their brothers horses, cattle, canvas, all sorts of edible supplies and crafts.",
  "679": "Tatar town of Mogilev governorship in Mstislav district. In the hold is one of the year Fair.",
  "493": "​​OMELNIK, place in Kiev Viceroyalty Myrgorod County. In the hold is in year two fairs: one on July 20, and the other on October 14; traded on the add immigrants from different county residents petty goods, there Rodia and do as - that bread, hot wine, raziym cattle, sheepskins, skins and so on. sometimes come and Great Russian merchants with red merchandise.",
  "778": "Shatsky, 1779, the city of Tambov governorship. In the hold is in year one fair at the tenth week after Easter on Friday; thereof trade on canvas, hemp and other petty.",
  "741": "HOMUTTSY, place in Kiev Viceroyalty Myrgorod County. In the hold there weekly for Voskresyanyam Torzhok, where trade visitors from county residents petty different products out there and do Rodia, kak some bread, hot wine, various cattle, sheepskins, skins and so on. Sometimes the Great Russian merchants and come with a red item.",
  "262": "Isetsky, Ufa governorship settlement in the county of the city of Chelyabinsk. There are fairs at the tenth week after Easter and October, 23 days; petty trade in goods.",
  "207": "Dukhovshchina, the city of Smolensk governorship. In the hold there are two fairs a year: the first in the first week of Lent on Friday, the second on August 15, in denuspeniya Virgin; merchants come from near lying cities with different goods.",
  "601": "SAMARA, since 1780, the city Sinbirskogo governorship. Here privozyate industrialists've July and August've Ize Kozachya town of Uralsk and Kazan ulovnuyu in the Urals fish, fish supplies and horses. To purchase this coming Russian merchants, and bring with them all sorts of petty goods and county townsfolk sell bread and other things beyond the river Samara.",
  "348": "Kremenchug, the city of the same governorship. In the hold over ordinary trading happens in year three fairs, lasting for three days.",
  "521": "PERESLAVL Zaleski, city Vladimerskogo governorship. It happens here with the annual Fair on June 23, and lasts for a week; thereof is sent to the bargaining lnyanymikolstami who bought Pereslavsky as well as visitors from different cities of merchants. Moscow merchants brought over silver various small items like - that salaries in the image and so on; boleezh krestyanami bring different bread for sale; and in the district of the city, in three villages torguyutv petty peasant goods and products.",
  "456": "Mtsensk, Oryol city governorship. There are weekly shopping congresses.",
  "44": "Bilyarsk, a suburb of Kazan governorship. Every week, one designated day is here bazaar, which attracts people from all around lying areas; brought to the market place all of their home needlework, with which they abound. For merchants, the auction this coming, made a few wooden stalls where they sell everything needed for farmers.",
  "39": "BEREZNIKI, a village in the Saratov governorship and county. There is fair in late July; bring on the judges petty merchants different silk goods.",
  "600": "SAVINITSY, suburb of Kharkov governorship in Izyum district. There are three fairs: the first on April 23, the day of the Great Martyr George; the second on August 15, the day of the Assumption; thirds of November 8, the day of the Archangel Michael. These should come to the merchants of various Russian cities with silk, cotton, worsted and other goods.",
  "360": "KUDARINSKAYA, Irkutsk governorship settlement in the county of Verkhneudinsk. There is fair Nov. 24 days; traded on thereof visitors from Siberia petty merchants different goods.",
  "756": "Chelyabinsk, since 1782, the city of Ufa governorship, which lies on the river Miyase from Dalmatovsky monastery in ste fifty-four miles, in the very middle of the Bashkirs may eventually become a noble vrazsuzhdenii trading venue; because the intention was accepted netokmo for greater capacity for Bashkirtsev there to have a fair, but also merchants from Great Bukhara, in Orenburg, so kind and there to translate. There are two fairs a year: the first on May 9, the second day of December 6th.",
  "287": "KIDESHKINO, a village in the district governorship Kostroma city Yurievets Polish. It. except weekly Torzhok, the day Boris and Gleb is the annual fair.",
  "370": "LAZOVITSA, town of Mogilev governorship in Klimovitskiy County. In the hold is fair in one year.",
  "759": "CHERENCHITSKOY, churchyard in the county town of Old Rouses. There is one annual fair on the day of Elijah's Friday, and merchants come from the Old Rouses with petty goods.",
  "646": "Sosnitsa, since 1782, the city Novogorodskago-Seversky governorship. In the hold of the year there are three fairs: the first on Cheese week, the second after Easter Sunday in the tenth Friday, the third day of the Exaltation of the Holy Cross. On discharge the same and weekly conventions come devious residents and sell bread, cattle, and other miscellaneous goods and petty things.",
  "702": "Troitsk, Monastery, Tambov governorship in Kozlov district. When it happens in year two fairs: i) on the day of Pentecost, 2) on the day of the Assumption of the Virgin. These should come to the merchants of Tambov and Zaraysk with silk and other small goods, and sell not more than a day.",
  "765": "CHERIOOSTROZHSKOY Mykolaiv, the monastery of Yaroslavl governorship. When the hold is Fair December 6, 9 May, but on the tenth Friday at the Cathedral Church of the Kazan Mother of God, to remember George the November 26 numbers, but tokmo notable items in the sale does not happen, and bring in the vicinity of the other cities in the small number of petty goods takozh county inhabitants edibles.",
  "785": "Shumyachi, town of Mogilev governorship in Klimovitskiy County. There are two fairs a year.",
  "402": "MAKALOVO, a village in the district governorship of Penza city Krasnoslobodsk. Here is one in a year's fair at the tenth week after Easter in heels; but come here for the most part peasants with their supplies.",
  "230": "Zamoshye, village Vologda Viceroyalty. Here vsenedelno on Sundays are Torzhok.",
  "801": "Yarensk, since 1780, the city of Vologda Viceroyalty. In the hold of the year is one small auction of January, from 18 to 23 day time-governmental petty goods on which merchants come from the Great Ustyug, Vologda and salt Vychegodskaya.",
  "89": "WHITE, the city of Smolensk governorship. In the hold there are two fairs a year; but going to discharge the same tokmo peasants with their products.",
  "529": "Petrovsky Sloboda Vologda Viceroyalty and counties. Here is one in a year's fair in June at St. John the Baptist. Here come the merchants of Vologda, Ustyug and Totemskie to buy canvases and sale of various petty goods.",
  "266": "Joseph's Convent of the same province in the Volokolamsk district. There are annual fairs: the first day of Pentecost, the second on September 8th Day.",
  "156": "Glushitsky, monastery in Kubensky side of the lake. Here is one in a year's fair; merchants come to buy canvases, bringing with them different petty goods.",
  "664": "STOYANTSY, a village in the Tver governorship Kashinskaya County. There is a one year Torzhok, where the goods are brought from county, linen canvases are different, from the city of Yaroslavl, Pereslavl Zaleski, Uglich merchants come with all sorts of petty commodities rather poor.",
  "680": "Tiberias, with the 1775 governorship main city of this name. There are two bids on Tuesday and on Thursday; and in the Tver district in Mikulski camp in the paternal Prince Meshchersky, in the village of Lotoshino, once a week on Sundays, and bring raznyhuezdov villages and peasants shared in the same trading days brownies products of their work, hemp, bread, butter and other petty.",
  "201": "oak, the village of Tambov governorship in Kozlov district. There is an annual fair on the day of Nicholas the Wonderworker on May 9, where merchants come near lying cities with different petty goods.",
  "634": "Sinyavka, town Chernigov governorship and counties. In the hold there are weekly on Saturdays Torzhok, which traded devious residents petty goods, bread and other things.",
  "181": "DAGDA, place Polotskogo governorship in Dinaburgsky County. In this place there are in a year triyarmarki; Riga Palace peasants sell various petty goods, wine and beer.",
  "750": "TSURUHATAEVSKOY, an outpost of the Irkutsk governorship in the Nerchinsk district. There is fair in June and July; bargaining takes place at the Russian and Siberian merchants with visiting by the Chinese prom-rated Russian and udder various Chinese goods.",
  "501": "nutcracker, a village in the Moscow Province Mozhaisk uzde. In the hold is the tenth annual Fair pyatyautsu after Easter.",
  "324": "root desert Kursk governorship and county, 27 miles from the city. When it happens in a year odinozhdy Fair, starting one week before the ninth Friday after Easter, and continuing on through that a few days after thereof. At the judges come from all cities netokmo Russian, but also foreign merchants, and the greatest of all sorts of Russian, German and Asian goods are brought; also great horses bargaining is done.",
  "62": "Borzna, the city of Chernigov governorship. In the hold is in the city, the three fairs.",
  "463": "NASPISCHI, a village in the county of Tula governorship city Alexina. There is fair on May 2 and July 24 days; merchants sell to farmers with adequate products.",
  "85": "Belikov, place Yekaterinoslav region in the Poltava district. In the hold is in year three fairs.",
  "548": "Pokrovsky, a village in the district of Moscow Province town of Ruza. In this and the village is an annual fair on October 1 day; petty trading different commodities.",
  "698": "Troitsk, since 1780, the city of Penza governorship. It is fair June 29 days beyond ordinary kazhdonedelnyh trading.",
  "398": "Favorite, the city of Yaroslavl governorship. It is two fairs a year: the first in Troytsyn day, the second on December 6; Continue schiyasya only one day. On these should come from nearby cities with silk merchants and other surovskimi chefs; and peasants from the surrounding villages with canvases and other products.",
  "30": "Balakleya, place of Kharkov governorship in Izyumovskom County. In the hold is in year five fairs: the first on Palm Sunday, the second on July 12, August 1 of the third, fourth September 23, the fifth December 6 numbers to merchants who come from different cities with silk, cotton, worsted and other goods.",
  "487": "Okunevskaya, Sloboda Perm governorship. There is Fair Feb. 2 days; petty trade in goods.",
  "587": "Rubezhnaya, Sloboda Count Gendrikova in Yekaterinoslav region near the settlement Saltovo. In thereof annual fairs are the first of January, 1, the second day of the Ascension, the third on June 24, the Fourth of July 20; fifth September 14. At these bids come from villages and settlements blizlezhaschih freeholders and Cherkasy, and petty trade in goods.",
  "240": "Zoloche, the city of Kharkov governorship. There are fair on June 29, August 6, December 6; petty merchants traded commodity, wine, beer, honey and other things.",
  "607": "Sasova, different village Lord. Tambov governorship in Shatsky district. There is fair on the day of Apostles Peter and Paul on June 29; sell canvas, hemp and other melochmi.",
  "640": "bold, town Chernigov governorship in Romenskaya County. There is a four-year fair: the first of January, 1, and the second on May 9, the third on July 8, the fourth October 14. At these should gather for sale of horses, cattle, kak some oxen, sheep, etc., Little Russian citizens; Rusko and merchants from different cities brings all sorts of petty goods.",
  "52": "Rich Girl, a place in Kiev Viceroyalty Myrgorod County. In the hold is in year two fairs: one on the day of Pentecost, and the other on September 1; traded on the add immigrants from county residents petty different products out there and do Rodia, kak some bread, hot vinom, various cattle, tar, sheepskins, skins and so on. Sometimes the Great Russian merchants and come with a red item.",
  "94": "VALDAI city Novogorodskogo governorship. In the hold there are three fairs: the first in Easter week, the second from October 23 to 28, the third in the Christmas holiday three days. These should come to the merchants from the surrounding towns with scrupulous small goods and victuals.",
  "6": "ADOVATOVO, the village of Nizhny Novgorod governorship in Arzamaskom County; in the hold is one in a year's fair.",
  "800": "Yaransk, from 1781, the city of Vyatka governorship. There are kazhdonedelno on Sundays congress at which merchants sell different silk and paper petty, also imported from counties, wax, honey, bacon, skins, sheepskins, hops and the local proizrasteniya different furs.",
  "552": "Porec, the city of Smolensk governorship. In the hold is in year two fairs: the first month of June the tenth Friday, the second on September 8, the day of the Nativity of the Virgin; merchants come from near lying cities with different goods.",
  "189": "Dorpat, the city of Riga governorship. In the hold of the year there are four fairs: the first for another day of the Epiphany, which many merchants come from Riga and Reval with silk and other goods, and trade for three weeks; though many come from the county and the nobility; second only lasts three days and begins on June 29, that is the day of St. Peter and Paul; on the judges bring salted and dried fish from Lake Peipsi Russian fishermen; sometimes also from nearby Russian cities bring merchants all sorts of goods iron pots and earthenware; thirds is September 8; on the judges come peasants with cow butter, hay to grain; the fourth is on September 19; thereof on the trade of cattle, horses and all sorts of bread.",
  "19": "Argamach, Sloboda Orlovsky governorship in Eletsky County. There is fair Sept. 8 days on which trading Elets merchants and other cities with county townsfolk all sorts of different petty goods and tar; and the townsfolk sold to merchants and their brothers horses, cattle, canvas, all sorts of edible supplies and crafts.",
  "96": "Valuiki, the city of Voronezh governorship. In the hold of the year is fair, called Peter; yes in the county in the settlement are fair, in Urazova seven in Nikolaevka four in five Pogromtse in Vendelevke three in Belokurinoy two in three Derkul.",
  "767": "Black from Tula city in 1777 governorship. The county thereof is one small fair of the year in villages in Devochkin, Zupnah, Annunciation, Baburin, Skorodnoye, Mother of God, jade tozh, St. Nicholas, in the language, Spaska that Zushe, Trinity and the Resurrection.",
  "248": "Ivanovo, Moscow Province village in Zvenigorod district. In this and the village is fair yearly July 8 days.",
  "292": "KIRILOEO, a village in the county of Tula governorship Novosil city. In the village there is the hold Fair July 15dnya, merchants peddling various petty Lavochne goods.",
  "788": "Shchigry, from 1779, the city of Kursk governorship. In the hold is one of the year Fair in Pentecost; besides the local townsfolk traded on Sundays peasant petty commodity, bread and meat.",
  "689": "Tikhvin, from 1776, the city Novogorodskogo governorship. In the hold is in year three fairs: the first on the first Sunday of Lent, and the other two in the summer and autumn.",
  "621": "Sergach, from 1779, the city of Nizhny Novgorod governorship. In the hold is bargaining in the spring during a hollow water, where peasants bring different supplies and crafts of his things.",
  "747": "TSAREV Borisov, the town of Kharkov governorship in the county town of raisins. In the case in the hold, four fairs: the first on vseednoy week, the second week Bearers, the third after the Holy Week in the ninth Friday, the fourth on November 8, the day of the Archangel Michael; merchants come to discharge the same from different Russian cities with silk, cotton, worsted and other goods.",
  "681": "Temnik, from 1779, the city of Tambov governorship. In this city, there is one annual fair after the feast of Holy Pascha in the tenth Friday one day.",
  "148": "Gdov, the city of Pskov governorship. There is a fair one year; Lavochne petty commodity trade.",
  "539": "PLOHONA, Kaluga governorship village in the county of the city of Kozelsk. There are kazhdonedelnye Torzhok on Sundays; to discharge the same trading merchant comes from Kaluga, Meshchovsk, Volkhov Beleva and other cities; bring products moskotilnye, some paper, silk and other varieties of matter, and for the most part and county goods, any bread, hemp oil, flax, wax, Wax, sailing weft yarn, canvas, linen, homespun and other peasant crafts and other petty items .",
  "459": "Soft, Tula village governorship in Kashira district. In the hold during the tenth and eleventh Fridays are fair, at which the goods on sale are imported from Kashira, Tula, Serpukhov, Venev and Zaraysk on a small number of moskotilnoy and sundries; and the inhabitants of the county for sale is hemp, honey, wax and wood products.",
  "121": "Volintsev place in the county town Polotska. Here is the year two fairs: the first on July 24, the second in October 1. The merchants of these should come to the neighbors' cities with different petty goods.",
  "107": "faith, the city of Moscow Province and the province. In the hold there in one year Fair June 23 day Vladimerskiya Dame, and lasts for three days; the judges come to the merchants of Moscow, Tula, Kaluga, Serpukhov, Mozhaisk, Borovsky and other neighboring cities; brought silk, paper, and other goods moskotilnye small number, but for the most part peasants come with linen and cartilage canvas wheels lykami and other petty commodity.",
  "277": "Carmen, town of Mogilev governorship in the county town of Rogachev. There is a four-year fair: the first on May 9, the second on August 15, the third on October 1, the fourth day of November 1st.",
  "533": "Pechenegs suburb of Kharkov governorship in the county town of raisins. In the case thereof, of the year four fairs: the first day of the Assumption, on August 6, the day of the Transfiguration, the third on October 28, the fourth on Vseednoy week on Thursday. Merchants come to discharge the same from different cities with silk, cotton, worsted and other goods.",
  "695": "Torzhok, 1775, the city of Tver governorship. There are three fairs a year: the first of January, 6, the second the first week of Lent Sunday, the third of September 15th.",
  "328": "KORSUN' city Sinbirskogo governorship. There is an annual fair, called the Trinity; begins Tuesday last week carnivore, and lasts until the first week of Monday Petrov post. Come to the judges from different cities enter the Russian merchants and Armenians, sell imported different silk, paper and other goods, and gather people of different ranks and peasants notable number of horses Kalmyk and Rusko, and from there the products of rural peasant Korsunskys and other inhabitants.",
  "482": "Obrubov, Tver governorship village in the county town Zubtsova. Here byvaesh annual Fair on April 23, the day of the Great Martyr George; on the judges come from neighboring merchants near cities with petty silk, paper and other miscellaneous goods.",
  "455": "Moore, city Volodimerskogo governorship. Here, apart from the weekly Saturday Market Place, June 25 days on the feast of St.. Blessed Prince Peter and Princess Fevronia of Murom Chudotvortsev happens mantis in which Murom merchants and inhabitants of other cities sell the following products: bread, meat, fish of different kinds, silk, calico , cotton material by color, paper, and the cotton dyeing cloth, not expensive prices, wax palm, sandalwood red and blue paint on a small portion of the squared, damask, Goals for flowers, bouquets, grezety, lyustriny, taffeta, muslin, kalamenki different hands , pozumentymenty oil on wood, turpentine, oil, alum, vitriol, sugar, tea, grape drink, lifestyle, iron, pestryad paper of different colors, and rabbit skins merlushchatye, hats, mittens, boots, worsted stockings, bridle, breast-bands tugs, girdles and other petty things takozh and peasant crafts.",
  "102": "Great, Yaroslavl governorship village in the Rostov district. In the hold is",
  "253": "Igumnovo, Tula village governorship in Kashira district. There is fair on the tenth and eleventh Fridays; to discharge the same fair goods imported from Kashira, Tula, Serpukhov, Venev from Zaraysk on a small number of petty moskotilnye and others, as food; inhabitants of the county for sale is hemp, honey, wax and all products.",
  "345": "Krasnopol, suburb of Kharkov governorship in the county town Meeropol. There are fairs, the first on May 9, the second on August 6, third day of November 8; these should come to the merchants from near lying cities with petty goods, and buy cattle, horses and more.",
  "61": "BORA, a village in Sinbirskom governorship from Sinbirska 60 miles. There are all notable trades week.",
  "665": "Strelitz, suburb of Kharkov governorship in Korochensky County. In the case thereof, of the year two fairs: On August 1, the second day of March 25th.",
  "534": "Pyriatyn, the city of Kiev governorship. In the case in the hold, four fairs: the first day seredopostiya, the second day of the Ascension, the third day of the Nativity of the Virgin, the fourth day of Paraskeva. The merchants of these should come to the Great Russian cities with red goods from the skins, iron and other things.",
  "103": "Wendy, the city of Riga governorship. There are two fairs a year: one in Ivanov and the other at Michaelmas; but these should in itself an important conclude nothing.",
  "645": "Sorochyntsi, place in Kiev Viceroyalty Myrgorod County. In the hold is in year five fairs: the first of January, 1, the second to the fifth week of Lent, the third day of Pentecost, the fourth on September 14, the fifth on November 14; traded on the add immigrants from county residents petty different products out there and do Rodia, kak some bread, hot wine, various cattle, sheepskins, skins and other things; sometimes come from Great Russian cities and merchants with red goods. Here there are weekly auctions.",
  "182": "DAYMINO or DAYMIK, village Kursk governorship in Schigrovskogo District; there are notable fairs.",
  "358": "Hook, Sloboda Yekaterinoslav region. In thereof are in year four of the fair.",
  "130": "Vyborg, the main town of this name governorship. In the hold there in every summer fair, as in the seaside; From here, let the sea board, resin, iron, and get salt, tobacco, wine and more. Over this is the year two fairs: the first August 24, the second on September 21, at kotoryyakrestyane bring mostly cattle, horses and food.",
  "554": "FLOW place in Kiev Viceroyalty Myrgorod County. In onombyvayut two fairs a year: DPA June 24 and another on October 6 numbers. Traded on the add immigrants from different county residents petty goods, ladies Rodia and do as - that bread, hot wine, various cattle, sheepskins, skins and so on. Sometimes the Great Russian merchants and come with a red item.",
  "782": "Shklov, Mogilev place governorship and counties. There are in addition to the weekly shambles three fairs that are from different places sbiralsya merchants with goods and a better mother; also in the hold and devious places are reserved.",
  "79": "BUCHALKI, a village in the Tula governorship Epifanskie County. In the hold is fair on June 26; merchants trading to come out of the cities with a variety of goods in not more.",
  "802": "YARESKI, place in Kiev Viceroyalty Myrgorod County. In the hold is in year two fairs: the first on June 24 and the other on August 15; traded on the add immigrants from different counties residents petty goods, there Rodia, kak some bread, hot wine, various cattle, sheepskins, skins and other things; sometimes come and Great Russian merchants with red merchandise.",
  "790": "YURYEV Polish, since 1778, the city Volodimerskogo governorship. Its inhabitants ply yuftyu also petty goods and garden works.",
  "308": "Kojin, village Volodimerskogo governorship in Gorokhovetsky County. Here is the trade congress on July 20 the Day.",
  "41": "Berezovka, Kostroma village governorship in Chuhlomskom County. It is fair on the day of Exaltation of the Cross; come to the judges of the surrounding towns with small number of merchants Lavochne goods.",
  "653": "STAVROPOL, since 1780, the city Sinbirskogo governorship. In the hold is a market day on Tuesday.",
  "136": "Vyshegorod village in the Moscow province Vereyskaya County. In the hold there are two fairs a year: the first in the tenth Friday, July 2 the second number; these should come to the merchants of the city Vereya, Mozhdysk and Borovsk, and many converges peasantry; sell all sorts of victuals and peasant commodity kak something wheels, tar and the like.",
  "700": "Trinity Sergius Lavra Moscow Province, the distance from Moscow to 60 miles. When thereof fairs are: 1) the tenth Friday, 2) Pentecost, 3) August 15 numbers each year; add-on trade visitors from different cities of the Great Russian merchants different silk, fur and petty goods.",
  "323": "Koprino, village and county Yaroslavl governorship. There is an annual fair Sergievskaya September the 25th day; sell at farmers thereof, butter and other products.",
  "373": "Lalsk city Vologda Viceroyalty. There is a year four fairs: the first on December 6, the second of January, 18, the third on March 25, the fourth in early June; on these should bring Ustiug petty merchants different products; while the peasantry homespun cloth, canvas, sheepskin, fur coats and other all sorts of petty and edible products.",
  "630": "SIM, village Vladimerskogo governorship in the county town of St. George-Polish. In the village there are seed fairs, and lined up for the series.",
  "573": "RATKOVKA, suburb of Kharkov governorship in the county town of raisins. In thereof are in year three fairs: First on Ascension Day, the second on August 6, the Transfiguration, the third on October 1, the day of the Intercession. Merchants on these should come from different cities with silk, cotton, worsted and other goods.",
  "755": "Chaus, from 1778, the city of Mogilev governorship There is one annual fair.",
  "515": "FOAM, Sloboda roundabout in town Karpov. In thereof are fair after Christmas on Vseednoy week on Saturday, June 24 and September 14, lasting one day. The merchants of these should come to the near lying cities Lavochne petty goods.",
  "140": "Vyaznikov city Volodimerskogo governorship. There is fair on the feast of the Blessed Virgin of Kazan on July 3 days.",
  "4": "AVZHENSKAYA, parish and county Vologda Viceroyalty. There happens twice a year, fair, way trade in goods Vologda petty merchants.",
  "72": "BORYATINO, Village of Kaluga governorship in Kozelsk district. There is bargaining one day a week in chetverpyuk; merchants from Kaluga, Meshchovsk, Bolhova, Beleva and other cities brought moskotilnye goods; but there are several paper, silk and other fabrics; but for the most part and county farmers bring different county goods, all the food, hemp, oil, honey, wax, Wax, sailing weft yarn, canvas, linen, homespun peasant different handicraft and other petty commodities.",
  "803": "Yaroslavl, since 1777 the main town governorship of this name. In the hold is annual Fair March 5 day, which attracts tokmo peasants; in the district of the city, osmnadtsat villages where trade conventions are, but for the peasants; from the bottom of the barge as cities come with bread for departure to St. Petersburg.",
  "42": "BERKUNOVA, the village of Moscow Province in Volokolamsk district. In this village there is an annual fair in the ninth Friday; trade one day different peasant goods.",
  "440": "homology, the city of Yaroslavl governorship. In the hold is in year two fairs, one of January, 18, and another in the fourth week of Lent on Wednesday at merchants who come from Belozersk, Uglich, Romanov and Borisoglebsk Rybinsk bread, fishes, myasami and wooden utensils.",
  "346": "Krasnoslobodsk, the city of Penza governorship. In the hold is one of the year at the Fair Eighth week after Easter in heels. Merchants come from nearby cities with silk, cotton, and other moskotilnymi different in a few products; bolsheyuzh peasants often come with their own supplies.",
  "332": "Kotel'nich city Vyatsky governorship. In this city, there is one in a year's fair.",
  "668": "Sugi, from 1779, the city of Kursk governorship. In the case in the hold, four fairs: April 23, the day of the Great Martyr George; June 29, the day of St. Peter and St. Paul; October 1, the day of the Intercession, but in the Christmas carnivore on vseednoy week for two days; these should come to the merchants of the neighbors' cities; brought silk, paper and other products a small number.",
  "544": "HEM, the city of Moscow Province. In it every week on Saturdays is bargaining, which attracts with its peasantry proizrasteniyami, articles and victuals;",
  "322": "Konstantinovsky, a village in the Tver governorship Kashinskaya County. There is Fair Aug. 15 days; goods imported from county linen canvases are different, from the city of Yaroslavl, Uglich Pereslavl Zaleski and merchants come from all sorts of petty commodities rather poor.",
  "45": "EXCHANGE, place Polotskogo governorship in Dinaburgsky County. In this place there is a fair one year; Riga palace peasants sell various petty goods, wine and beer.",
  "707": "Turin, since 1782, the city of Tobolsk governorship. There are notable trade congresses at all on Sundays.",
  "104": "Venev, Tula city governorship. In this city, there is an annual fair in the tenth Friday after Easter; nonresident merchants peddling a variety of goods.",
  "748": "TSARICHENKA, place Yekaterinoslav region in the Poltava district. In the hold of the year there are three fairs.",
  "655": "OLD Ruza, from 1776, the city Novogorodskogo governorship. Here is the congress and trade of January, day 6, the Feast of the Holy Apostles Peter and Paul, and on the day of the Holy Virgin; goods brought by merchants from Novagoroda and all sorts of Toropetz moskotilnye and hay scythes.",
  "382": "Lipovskii, a village in Vologda Viceroyalty Yarensky County. In the hold is trade of January, once in the year 19, but most of the trades are peasants.",
  "171": "Gorohovets city Vladimerskogo governorship. There are no trade fairs, and sometimes alone, the distance from thereof in twenty-four miles beyond the river Klyazma at Florischevskoy desert right before zdnika Assumption of the Virgin in five days, which brought canvas and other petty Russian goods.",
  "384": "Liska, portage that Singh, in the Vologda district. Here is the year two fairs; add-on trade in goods Vologda petty merchants.",
  "433": "Mikhailovka village of Kharkov governorship in the county town of Swan. In the village there are the hold three fairs: On February 2, the second day in the cutting off, the third of September 8. The merchants on these should come from the near lying cities Lavochne goods and hot wine, also victuals.",
  "780": "Shiping, a village in the Tver governorship Bezhetsky County. There is an annual fair on September 14, the number to which the inhabitants of the county bring any bread and other syreynye and edible products.",
  "749": "TSEVLYA, G. Sumarokova village in the county town Opochek. Here is one in a year's fair.",
  "724": "Ustyuzhna ZHELEZOPOLSKAYA, from 1776, the city Novogorodskogo governorship. There is bargaining in the week, once on Saturday and bring more in the winter of counties Ustiug, Novogorodskogo, Bezhetsky, Yaroslavl, Beloezerskogo county townsfolk all usypnoy and milled grain, flax, canvas cloth, sheepskin, food and other needs.",
  "730": "FLORISCHEVA, desert Volodimerskogo governorship in Gorokhovetsky County. There is fair before the feast of the Assumption of the Blessed Virgin Mary for five days, which brought canvas and other petty Russian goods, and also silk.",
  "24": "ASAKOVO, a village in the Tula governorship Venevsky County; here is the annual fair of July 8; come to the judges merchants different cities with the goods.",
  "195": "DOMNITSKOY, the monastery of Chernigov governorship and counties. When the hold. happens",
  "690": "TIKHONOVA, desert Orlovsky governorship in Karachevsky County. There is Fair June 16 date, which brings different cities merchant silk and other goods.",
  "274": "Kamyshnaya or KOMYSHNYA, place in Kiev Nastnichestva Myrgorod County. In the hold is in year three fairs: the first on Palm Sunday, the second to tenth after Easter Sunday Friday, the third on October 26, the day of St. Demetrius. Add-on trade cattle and horses, and at weekly on Monday and Friday trading trade visitors from devious places bread and victuals.",
  "58": "Epiphany, Sloboda Vladimerskogo governorship in Suzdal district. There is an annual fair; on the judges come from different cities of the merchants with goods.",
  "203": "Dubrovka village Penza Namestnichastva in Saransk county. There is fair in late July; bring different petty merchants silk goods.",
  "355": "In addition, the city of Oryol governorship. There are two fairs a year, after the Holy Easter at the tenth and eleventh week, and trade is brought in by willows merchants different cities with silk and other small commodities; godevye and county residents are their own bargaining tutoshny proizrasteniya of places and works rukode veschmi Liem, a small number of hemp and canvas.",
  "789": "YUNAKOVKA, the village of Kharkov governorship in Sumy district. There is a four-year fair; to discharge the same merchants come with petty goods and hot wine.",
  "282": "Kashin, a city of Tver governorship. There are two fairs: the first in Lent in the second week on Sunday, which is quite high due to the judges sezzhayuschagosya nobility and the county inhabitants; second after the Holy Week in the tenth Friday. Goods are brought to discharge the same county of linen canvases are different, from the city of Yaroslavl, Uglich Pereslavl Zaleski and merchants come from all sorts of petty commodities rather poor.",
  "676": "Tambov, 1779 with the main town of this name governorship. There are two annual congress over ordinary trading: the first month of June on the tenth Friday; the second to the Kazan Mother of God praying mantis on July 8, and these trades continue two days.",
  "258": "InSAR, the city of Penza governorship. In this city, there was a fair one, called the Trinity which came merchants from near lying cities with inexpensive goods.",
  "197": "DOROGOBUZH, the city of Smolensk governorship. In the hold is one annual fair, the month of June before Petrov during the day and comes out near city merchants. The county thereof, is fifty-two villages, in which there is during the holidays Congress temple merchants only with some eatables.",
  "372": "LAKNOVAT, churchyard Pskov governorship in Velikiye County. There is fair of January, the number 6; on the inhabitants thereof, to sell leather, linen, hemp, honey and other things like that; and",
  "737": "Khvalynsky, since 1780, the city of Saratov governorship. There is np mark the day on June 28, which for the most part sezhaetsya peasantry.",
  "387": "LOTSSHINO, village Tver governorship. There is bargaining odinozhdy a week on Sundays, which bring different districts and villages of peasants different goods house of his work, kak some hemp, bread, butter, and other trifles.",
  "775": "Shamova, town of Mogilev governorship in Mstislav district. It is a fair of the year.",
  "462": "Narovchatov, the city of Penza governorship. In this city, there are three fairs a year: the first on June 29, the second on July 20, the third day of August 6, over Common kazhdonedelnyh trading.",
  "774": "Lufia, from 1781, the city of Perm governorship. In the hold is in year three fairs: the first on June 29, the second on November 3, the third in the first Sunday of Lent; add-on petty trade in goods.",
  "758": "Cherdyn, from 1781, the city of Perm governorship. In this city, there is a fair one year.",
  "584": "Romain, the city of Chernigov governorship. In the hold is in year four fairs: the first week of Oil, the second day of the Ascension, the third day of the Prophet Elijah, the fourth day of the Cathedral of the Archangel Michael. Here come the merchants of the Great Russian, Little Russian and foreign silk, cotton, worsted, silver, copper, tin, haberdashery and other goods, and especially the great bargaining and vacation here is tobacco.",
  "625": "earrings, Sloboda Vologda Viceroyalty in Yarensky County. There is Fair June 23 to 26; thereof to buy from different manufacturers furs.",
  "545": "Pokrovsky, Lubos tozh, Village Orlovsky governorship in Livenskom County. In the hold is annual Fair on July 15; surrounding merchants come here with silk and other petty commodities and also the peasants.",
  "283": "Quemaro, the village of Nizhny Novgorod governorship in Arsamazskom County. Here is one in a year's fair.",
  "415": "MACHUHA, village Yekaterinoslav region in the Poltava district. In the hold is kazhdonedelnoy bargaining between residents of different edible roundabout and drinking supplies.",
  "386": "Lopota, the monastery in the Vologda district. There is one day a year the fair; Vologda merchants traded on thereof petty goods.",
  "219": "Epiphanes, the city of Tula governorship. In the hold is fair on May 9, that is, on the day of Nicholas the Wonderworker. Merchants come from surrounding cities with different not in notable number of products.",
  "353": "KRIZHBURG, place Polotskogo governorship in the county town Dinaburga; in this place there are three fairs a year, and sell the Riga Palace of peasants different petty goods, wine in beer.",
  "596": "turnip, town Chernigov governorship and counties. In the hold there are weekly Torzhok, where bargaining is done in a roundabout residents for the most part with bread and other household things and peasant products.",
  "538": "flat, a village in the county of Tula governorship Novosil city. In the village there is the hold Fair on May 25 and November 8; petty merchants sell different goods and bread.",
  "572": "ramen, the village of Moscow Province in Volokolamsk district. Here are the year Fair June 24 and September 18; trade one day different peasant goods.",
  "56": "Bogoroditskaya KAZAN, Monastery of Penza governorship in Nizhelomovskom County. It happens here yarmarkaa annual July 1 to 9 numbers.",
  "60": "Boyne River Tver governorship. At the mouth thereof to the county town Zubtsova are two fairs a year: the first on July 20, the day of the Prophet Elijah, the second on August 6, the day of the Transfiguration. Merchants come from the surrounding neighbors cities with petty Lavochne silk, paper and other goods.",
  "485": "Audrina Mykolaiv, Orlovsky monastery governorship in the county town Karacheva. When the hold monastery is Fair May 9th day.",
  "432": "Mikhailov, the city of Ryazan governorship. In it each year on the tenth week after Easter in pyatokbyvaet fair, where merchants from nearby cities traded petty merchandise.",
  "703": "Trubchevsk, since 1778, the city of Oryol governorship. In the hold is at year's fair, which begins with Pentecost, and lasts a week.",
  "566": "navel village Vladimerskogo governorship in the county town of Shuya. In the hold is the annual fair of the month of May 9 day seven-day, referred to as: Nicholas; traded on nonresident thereof merchants different Russian and German of goods.",
  "124": "VORONEZh, town Chernigov governorship in Nezhin district. There is a three-year fair.",
  "392": "Lukoyanov, the city of Nizhny Novgorod governorship. In it every week on Sundays is bargaining, which come peasants, but more bread.",
  "27": "Atkarskaya, the city of Saratov governorship; here in the city is the weekly auction, and in the area thereof in some villages on the river and tierce Bolonde Torzhok, where sales are made, as well as in other places of this Province.",
  "736": "HAYACHA, town of Mogilev governorship in the county town of Rogachev. In the town there in the year two fairs.",
  "536": "scribe, village and county Kostroma governorship. There are annual fairs in the ninth and tenth week after Easter, which built and shops.",
  "661": "Stary Oskol, from 1779, the city of Kursk governorship. In the hold of the year there are three fairs: the first to the fifth Sunday three days, and the second on July 8, the day of Our Lady of Kazan, the third on August 15, the day of the Assumption, two days; merchants come with a variety of goods from the near lying cities.",
  "270": "Kaliberda or Keleberda, place Yekaterinoslav region. In the hold of the year there are three fairs.",
  "36": "Bakhmach, place the same governorship and counties. In the hold is fair on the day of the Transfiguration; come to trade on the judges from near salt, fishes, hot wine, beer and other things.",
  "699": "TRINITY, a third of Vologda Viceroyalty. There are fairs of January, 1, 5, 6 and 18, but on March 17 and 25 numbers, which in the neighboring villagers thereof, the local merchants buy butter, lard, beef and lamb leather, bear, wolf, hare, Belli, canvasses , homespun cloth and Dichin.",
  "118": "VOLOKOPINEZHSKAYA, a village in the Dvina Province near abroad Kevrolskogo. There is a year's fair, called Volokopinezhskaya, early in the month of December; but by what is called and St. Nicholas. For the most part on this very fair and Kholmogorskaya come Arkhangelsk merchants with goods not a high price for the sale of the peasants and to buy their goods village, to which he brought with him the money.",
  "116": "VOLODIMERETS, place Pskov governorship. Here established Fair in St. Nicholas Day, which come from different places with petty commodity.",
  "108": "TOP Udi, the city of Irkutsk governorship. There are two fairs a year: the first from 15 February to mid-March and the second from 15 June to mid-July; trade and fishing on the add consists of various imported from Irkutsk and other cities of Russian merchants and German goods, which traded at local infidels furs, cattle, horses, and so on. and transported through Trinity fortress Kiakhta for Promen Chinese.",
  "417": "lighthouse, the village of Kharkov governorship in the county town of raisins. In the hold there are two fairs: the first of January, 1, the day of St. Basil the Great, the second on October 1, the day of the Intercession of the Virgin. Merchants come to discharge the same from different Russian cities with silk, cotton, wool and other goods.",
  "242": "Ivangorod, town Chernigov governorship in the county of the city of Nezhin. Here is the year two fairs, the first and Paul, in the month of June, the second Simeon in September. On discharge the same merchants come from Nezhin, Borzna, Konotop and Ichni different petty commodities like - that Kramnoy Drobyazko, boots, miscellaneous ware, vyaloyu fishes and others.",
  "186": "DEMSHINSK, settlement Tambov governorship. Here is August 29th Fair, which attracts from the near lying places kuptsyi other commoners with different goods and sstnymi supplies.",
  "82": "Bezhetskaya, the city of Tver governorship. It is fair, starting June 30, camping, and continuing until July 5; merchants come from neighboring towns; bring silk and other goods moskotilnye petty and iron. Here we are on Monday and Thursday of Torzhok. The county thereof are yarmarkizh in villages near the Savior on the hill Kesove mountain Molodova and Porec, where and weekly auctions are on a hill Tuesday, Molodova Wednesday, and Kesove and Riverlands Friday. In the same villages and Povodneve Shiping annual fairs are 14 days of September; and in the village Kesove mountain on the 24th day of June, at which the inhabitants of the county is brought all the food and other syreynye and edible products; and from other cities of the county inhabitants petty goods, except that Kesovu mountain will not go.",
  "234": "Zvenigorod, the city of Moscow Province. Fair happens when stauropegic Storozhevsky Savina monastery from Zvenigorod a mile, daylight saving time on the tenth Friday imported from different places small silk tovaramii junk and edible grubs from the peasantry.",
  "453": "MURZYNKA, trench same governorship. In the case in the hold, four fairs.",
  "650": "Spaska, a village in the Yaroslavl governorship Poshehonsky County. There is an annual fair on the day of the Transfiguration, and lasts two days.",
  "144": "Gagarin, the village of Tambov governorship in Shatsky district. It happens here at the tenth annual Fair week after Easter on Friday; sell canvas, hemp, wool and other petty.",
  "5": "Abram Monastery Kostroma governorship, from the city Chukhloma 10 miles. There is fair. Behold Chuxloma city.",
  "452": "MURATOVA, settlement in Yekaterinoslav region. In the case thereof, of the year four fairs.",
  "705": "TULA, 1777 with the main town of this name governorship. There is fair of the year twice, I) at the Church of the Holy Virgin, in the tenth of the Friday of Holy Week; second day of June 8, when the policeman lock consisting of the Kazan Cathedral. For goods brought in by the folds are under Tula Magistrate in the lower department, also built individual tents. With products for fair outsiders Congress does not happen, but only sent there the. In week two trades on Monday and Thursday of.",
  "641": "Sokolov, place Polotskogo governorship, means there are two fairs a year.",
  "410": "Mangazeev or Turukhansky, the city of Tobolsk governorship. In this city, is fair in the summer, in June and July; bids are a Great Russian and Siberian merchants different cities by purchase any trapped animals Siberian and Russian sales petty goods.",
  "718": "Usmani, from 1779, the city of Tambov governorship. It is one of the year on the tenth Friday Fair, which lasts 7 days, merchants who come from Voronezh, Lipetsk and Yelets with different cloth and silk and petty goods.",
  "612": "SVIAZHSK, from 1781, the city of Kazan governorship. There is fair, and trade on thereof petty goods and victuals.",
  "513": "Parfen'eva, Kostroma Sloboda governorship. In the case thereof, of the year two fairs: the first Sunday of Pascha in the ninth week, the second on July 25; these should come to the merchants from near lying cities with petty goods.",
  "200": "Dubkov, a suburb of the same vicariate and district. There are annual fairs: 1 Transfiguration of Our Lord, 2 the day of Pentecost.",
  "479": "Nizhin, the city of Chernigov governorship. In the hold is in year three fairs: the first in February Vseedinskaya 9 second Trinity in June, a third of the Intercession on 1 October; Great Russian trade and Little Russian merchants and Greeks silk, cotton, woolen goods, palm, tea, Voloshskaya wines, Crimean salt ikroyu, fur Russian goods, honey, wax, hair, hot wine, tobacco, and other things.",
  "50": "BOGATISCHEBO, Tula village governorship in Kashira district. There is Fair July 8th day on which the goods on sale are brought from Kashira and near Tula, Serpukhov, Venev and Zarajsky, in a small number of moskotilnoy, sundries and other edibles, and more than the inhabitants of the county for sale is hemp, honey wax and other rustic products.",
  "692": "TIKHONOVA, desert Kostroma governorship in Luhovskom County. There is Fair June 16 days.",
  "426": "MIZHIRICH, a place in the Ukraine. In the hold are fair: the first on May 9, the second third of October 26. July merchants came out of the cities with the petty goods.",
  "350": "sacrum, the city Novogorodskogo governorship. Sometimes there annual convention for trading on September 15 days.",
  "184": "Dvurechnaya, suburb of Kharkov governorship in Izyum district. In the case thereof, in the year five fairs: the first of January, 1 day",
  "602": "Samborski, trench Yekaterinoslav region. In the hold spend time in year three fairs.",
  "379": "Livni, the city of Oryol governorship. There is a fair one year after Easter at the tenth week on Friday; come to the judges merchants from surrounding cities with silk and about Chimi petty goods; also collected and peasants with their products.",
  "419": "Mglin city Novogorodskogo - Seversky governorship. In the hold is in year three fairs: the first in the third week of Lent, the other on the day of Pentecost, the third of August 9th. On these should come from the neighbors' places merchants with red products and other petty; and merchants of the city sells its products proizrasteniyami and how - that hemp, hemp oil, hot wine, tobacco and other melochmi; hemp some merchants sent to S. Petersburg and Riga port and marina Poretsky and Irzhevskuyu.",
  "563": "Protopopova, settlement in the tract of the Cathedral of St. Nicholas Gostunskii, near the town of Tula governorship Belov. In thereof are fair on May 9 and Pentecost, lasting one day; visiting merchants from neighboring towns to sell the add silk and other petty commodities, also horses and other things.",
  "69": "Borovichi city Novogorodskogo governorship. There are three fairs a year: the first of January, 25, the second day of the Holy Trinity, the third of November 21, on koi and merchants come from other cities with silk, wool and other goods.",
  "135": "Vyshegorod suburb of Pskov governorship. In the hold is in year two fairs: the first day of Boris and Gleb, and the other on the day of St. John the Baptist.",
  "429": "Meeropol, the city of Kharkov governorship. In this city, there are three fairs a year: the first in the fifth week of Lent, the second to the seventh week after Easter, the third of September 1 day. These should come to the merchants from near the Great Russian cities, and bring all sorts of small domestic goods traded as cattle and horses.",
  "500": "Orlov, Sloboda, Voronezh governorship. There is a fair one year, called the Ascension in Maie month; bargaining continued for five days; merchants came out of the cities, and sell various goods silk, cloth, and for the most part petty things.",
  "14": "Aleshnya, Sloboda Kursk governorship in the Belgorod district; thereof in the case of the year three fairs: the first on July 17, the second on September 6, the third of December 4. The merchants on these should come from nearby towns; trade cloth, silk, paper and naboychatymi goods, iron, linen, dishes and stuff.",
  "275": "Karas - BAZAAR, a town in the Tauride Province. It happens every week on the same day auction, which fetches the set of all the beasts that as - that of horses, buffaloes, oxen, cows, camels and sheep.",
  "318": "KOMLICHKI, the village of Kiev governorship in Lubenskiy County. In the hold is in year two fairs: one on St. Thomas after Easter week, the other day Barbara.",
  "48": "Bobrowski, a village in the Perm governorship Krasnoslobodsky the district. Here is the day of Apostles Peter and Paul to two days after thereof fair, which Especially nice horse trade. Built as twenty wooden benches for merchants coming to this very fair, where they Folding products, bargaining produce.",
  "627": "MIDDLE BUDA, Chernigov rural district governorship in Nezhin, General Field Marshal Earl Rumiantseva Transdanubia. There is a fair one year on September 8th.",
  "684": "Tereshkova, a village in the Tver governorship Zubtsov County. It is the annual Fair on May 20, the day of Metropolitan Alexis; on the judges come from neighboring merchants near cities with petty silk and other goods.",
  "132": "HIGH, a village in the Tver governorship Kashinskaya County. In the hold is fair Sept. 8 days, which is brought from county linen canvases are different, from the city of Yaroslavl, Uglich Pereslavl Zaleski and all sorts of petty-poor products.",
  "530": "Petrovsky, Village Orlovsky governorship in Eletsky County. There is Fair June 19 numbers; thereof on trade Elets merchants and other cities with county townsfolk all sorts of different petty goods; and the townsfolk sold to merchants and their brothers horses, cattle, canvas, and all sorts of edible supplies and needlework.",
  "556": "FIX, the city of Nizhny Novgorod governorship. In it, apart from the weekly on Thursdays bargaining, it happens in the day od 25 May Fair, the second coming from near cities with petty merchants silk goods, farmers bring former bread, wood and wooden utensils.",
  "517": "PEREVITSKOY Torzhok, a village in the Ryazan governorship Zarajsky County. In the hold each week in one Saturday afternoon to come Zaraiskiy trade and other towns of the county inhabitants with bread, meat, fish of salted and fresh, with a wooden utensils, sanmi and wheels; and Zaraisky merchants and petty moskotilnym with different products.",
  "407": "SMALL Arkhangelsk, the city of Oryol governorship. It happens twice a week Congress.",
  "547": "Pokrovsky, a village in the county of Tobolsk governorship of the city of Tyumen. In the hold is yearly July 8 small number of Torzhok.",
  "128": "Vrevo, a suburb of Pskov governorship. There is fair on the day of St. Nicholas, which come from different places with petty commodity.",
  "73": "bronnitsy, the city of Moscow Province. In it, apart from the weekly on Mondays and Fridays auction, scheduled on September 6th annual fair.",
  "28": "Romney, the city of Kharkov governorship; it is four fairs: the first week of vseednoy, the second on May 9, July third quarter on Oct. 28 days; merchants come from just tions cities bring brocade, silk fabrics and silver in the case; traded as cattle, horses and other things.",
  "597": "Ryazhskaya, the city of Ryazan governorship. There are three fairs a year in the month of July: the first to the ninth, tenth in the second, the third in the eleventh Friday after Easter and lasts no more than, as one day. Merchants come from nearby cities, and brought silk, paper, chandlery and other goods on a large number.",
  "49": "BOBYLEVSKOE, Ufa governorship village in the Chelyabinsk district. There is a year Fair of January, 30 and October 1. They trade melochnyii different goods.",
  "368": "Ladin, Nunnery Chernigov governorship in Prilutskii County. Here is October 1st day of the Intercession of the Virgin fair where residents sell their devious places proizrasteniyami, kak some bread, various cattle, victuals and other peasant trifle.",
  "590": "Rušona place Polotskogo governorship in the county town Dinaburga. In this place there is a fair one year; Riga Palace peasants sell various petty goods, wine and beer.",
  "494": "ONOFRIEVO, the village of Moscow Province in Zvenigorod district. In the hold annual fair is in the 12th day of June.",
  "490": "Olonec, the county town governorship of this name. In this city, there are two fairs a year: the first of January, 6, and the second in September 8. Trading on the add lasts for a week.",
  "143": "Gavrilova Sloboda Vladimerskogo governorship in Suzdal district. Here is the code Fair July 4th day; come from different cities with merchants melrchnymi Kupetsky goods.",
  "389": "Lubna, the city of Kiev governorship. It happens in year four fairs: the first at Shrovetide, the other in Troytsyn day, the third day of the Transfiguration, the Fourth Day of the Protection of the Mother of God; these should come to the merchants of the Great Russian and Little Russian cities with silk, cotton, wool and other goods internal priugotovleniya; traded as cattle, horses, hot wine, skins and other things.",
  "110": "VESIEGONSK, the city of Tver governorship. Sometimes there is one fair on the feast of the Epiphany; goods are brought in different ranks, and edible moskotilnye, as fur and iron and copper utensils, tin and wood, leather shoes, stockings and worsted wool.",
  "190": "Dinaburga city Polotskogo governorship, in this city, put on privileges of the three fairs a year: the first of January, 6, the second on June 24, the third of September 8; but now they do not happen; in the district of the city, in the fifty-six villages are; Only bids on whom tutoshnie Riga residents and inhabitants traded petty German goods.",
  "422": "MENA town Chernigov governorship. In the hold is in year two fairs: one on May 9, the day of St. Nicholas, the other on September 8, the day of the Nativity of Our Lady. Add-on and the weekly trade congresses devious residents and visitors of the city petty merchants Lavochne goods, cattle, horses, bread, fishes, Crimean salt and other edible and drinking supplies, and also handmade things.",
  "617": "SEMENDEEVO, a village in the Tver governorship Kashinskaya County. In the hold is fair in Friday's day; yes the same paternal under the monastery at Whitsun and the tenth Friday; Items on these should bring linen canvas of the county are different, from the city of Yaroslavl, Pereslavl Zaleski, Uglich merchants come with all sorts of petty commodities rather poor.",
  "797": "Yampil, suburb of Kharkov governorship in Izyum district. There are three fairs a year: the first on May 9, the day of Nicholas the Wonderworker, and the second on November 1, the day of Kozma and Damian, the third on December 6, the day of Nicholas the Wonderworker; merchants come to discharge the same from different cities with silk and other goods.",
  "636": "SLAVGORODKA, settlement near the city of the Free. In thereof is six fairs a year: the first of January, 7, and the second on April 23, the third 25 July, 1 August fourth, fifth on November 21, on the sixth Cheese week. Merchants come to discharge the same from the surrounding towns, trade cloth, silk, paper and naboychatymi goods, linen, iron, dishes and stuff.",
  "225": "Zhigansk, the city of Irkutsk governorship. In the hold are fair in August, September, October and November.",
  "771": "Chuguyiv, since 1780, the city of Kharkov governorship. In the hold is fair on the day of the Transfiguration, which come with all kinds of silk and other goods from Moscow and other cities of the merchants, and peasants takozh.",
  "663": "STESHKI, the village of Tambov governorship in Kozlov district. The annual fair in the hold is 20 July, that is, on the day of the Prophet Elijah; on the judges come from merchants near lying cities with different petty goods.",
  "134": "VYCHUGA, Kostroma governorship village in the county of the city of Kineshma. There is an annual fair at Whitsun.",
  "385": "Lihvina, the city of Kaluga governorship. In the hold is one annual fair.",
  "297": "Kyshenko, place the same governorship and counties. It happens on Sundays kazhdonedelno bargaining on any sell bread and wooden utensils.",
  "520": "Przemysl, the city of Kaluga governorship. There is an annual fair in excess of ordinary trading on the tenth Friday after Easter; brought for sale hdeb, hemp, hops and so on.",
  "155": "deaf, city Novogorodskogo - Seversky governorship. In the case in the hold, four fairs: the first Vasilyevskaya, of January, 1, the second in Troytsyn day of the third Elias, July 20, the fourth St. Michael, November 8. The merchants on these should come from the near lying cities such as Great Russian and Little Russian, with different petty goods ; and residents sell bread, hot wine and other things.",
  "238": "ZMETNEV, village Novogorodskogo - Seversky governorship in Sosnitsky County. The townsfolk thereof are fair dispensation beavers, otters and fish in Desna fishing.",
  "166": "Mounds, place in Kiev Viceroyalty Lubenskiy County. In the hold is in year three fairs: the first of January, 1, and the second on May 2, the third day of August 1st.",
  "416": "Maszewo, village Novogorodskogo - Seversky governorship in Starodubovskom County. In the hold are small weekly Torzhok.",
  "17": "Antonivka, town of Mogilev district governorship in Rogachev; here is the year three fairs.",
  "361": "Kuznetsk, a town of Saratov governorship. There is bargaining over the weekly fair congress in the tenth Friday after Easter.",
  "138": "branches, place Mogilev governorship in the county town of Rogachev. There is a three-year fair.",
  "65": "Borisoglebskaya, the city of Tambov governorship. It is one of the year on July 8th day of the fair, on the way trade three days coming from nearby cities for the most part petty merchants goods.",
  "68": "BOROVENKI, place Yekaterinoslav region. There are three fairs a year.",
  "421": "Medyn, the city of Kaluga governorship. In it, except for the weekly shambles, is July 8th day of the annual fair, where merchants come from different cities with silk, paper and moskotilnymi Niska prices of goods, with sugar and kofiem.",
  "146": "GALYANI, place Polotskogo governorship in Dinaburgsky County. In this place there are two fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "557": "Poshekhonye, ​​the city of Yaroslavl governorship. Here, apart from the weekly trades on Tuesday, Fair is 1 for the holiday of the Holy Trinity, 2 in September on the feast of St. John the Evangelist, who come to the merchants from touching the cities of Yaroslavl, Romanova, Uglich and Vologda with different goods, and trade on the week.",
  "288": "Cymru, the village of the same district governorship in Kashinskaya. There is on the whole week of trading on Monday; goods imported from county linen canvases are different, from the city of Yaroslavl, Uglich Pereslavl KPD and all sorts of petty-poor products.",
  "212": "The Catherine, HALAN tozh, settlement near the village of Kiev Viceroyalty Yabluneva. In thereof are three fairs a year; merchants on these should come with a variety of goods.",
  "300": "WEDGE, the city of Moscow Province. In the hold is annual Fair on Friday before the Saturday; on the judges come from other counties, and weekly trade on Saturday peasant different goods, wheels and all sorts of wooden utensils and other victuals; Often there are also some merchants from surrounding cities with petty silk and paper goods.",
  "172": "pea place in Kiev Viceroyalty Lubenskiy County. There is year three fairs: the first of January, one day, the second of the wires Bright Week, the third of September 14 days.",
  "99": "Vasco, a village in the Arkhangelsk governorship Mezensky County. There is a small annual fair in the month of January, called Mezenskaya on which a fair Volokopinezhskoy chaesh some petty goods passes.",
  "568": "Putiatina, a village near the town of Tambov governorship Good. There is a year Fair July 8, which come with petty merchants goods.",
  "609": "Sverzhin, town of Mogilev governorship in the county town of Rogachev. There is a year's fair on the day of the Ascension of Christ.",
  "123": "VORONEZh, the main town of this name governorship. In it, apart from the weekly on Mondays and Fridays Sereda trading, there are two fairs a year: the first in the city on Friday the tenth and final settlement with Chizhovka 29 day of August.",
  "476": "Nosovich, town of Mogilev governorship in Belitsk County. It happens in year six fairs.",
  "725": "UTVYMSKAYA, Vologda Viceroyalty parish in the county town Yarensk. There is fair of January, from 24 February to 5 numbers, which come from different merchants Russian cities with Lavochne goods.",
  "633": "Sinskaya, churchyard Pskov governorship in the county town of the island. Here is the year two fairs: the first in June, the second in October; these should come to the merchants from Pskov with different petty goods.",
  "180": "GUSTINOVO, Tula village governorship in Kashira district. There is Fair April 23 date at kokotoruyu goods imported from Kashira, from Tula, Serpukhov, Venev and Zaraysk on a small number of moskotilnoy melochnoi, but more so from the county inhabitants sale is hemp, honey, wax and other wooden products.",
  "781": "Shishak, place in Kiev Viceroyalty Myrgorod County. There are two fairs a year: the first day of Pentecost, the second of November 8; traded on the add and weekly on Sundays congresses visitors from county residents of different small goods, there Rodia and do, kak some bread, hot wine, various cattle, sheepskins, skins and so on. Sometimes the Great Russian merchants and come with a red item.",
  "495": "Opochki, the city of Pskov governorship. In this city, there are three fairs a year.",
  "378": "plank, village Vladimerskogo governorship in Suzdal district. There is an annual fair in the day Semik; come from different cities with different goods merchants.",
  "236": "Zinc or Zenko, the city of Chernigov governorship. In the hold is in year four fairs: the first on June 25, the day of St. John the Baptist, and the second on August 15, the day of the Assumption of Mary, the third on October 1, the day of the Virgin of Mercy, the fourth on December 6, the day of St. Nicholas. On the add different trade cattle, bread and victuals. There are weekly and Torzhok on Monday and Friday, and traded on the add bread.",
  "796": "Yakutsk, since 1783, the city of Irkutsk governorship. There are fairs in December, in June, July and August, when from different cities of the Lena river slides over the top with all sorts of goods merchants.",
  "381": "Lipetsk city of Tambov governorship. There are three fairs a year: the first on April 21, the second on June 23, the third 15 August numbers. These should come to the city from nearby merchants and trading day for two different products.",
  "224": "Efremov, Tula city governorship. In the case in the hold, four fairs: the first in June, called the tenth Friday, the second on August 6, the day of the Transfiguration, the third on September 15, the day of the Great Martyr Nikita, the fourth October 1, the day of the Intercession of the Virgin. Merchants come from surrounding cities with different goods, but for the most part with petty.",
  "312": "Kozlovka, Tula village governorship in Kashira district. There is Fair May 9 numbers; the judges on the products on sale are brought from Kashira, Tula, Serpukhov, and Reneva Zarajsky, in a small number of moskotilnye pettiness, and indeed of the inhabitants in the county is selling hemp, honey, wax, wood products.",
  "722": "UST-Sysolsky, since 1780, the city of the same governorship. There is fair from 26 November to 29 numbers; merchants buy from leading industrial furs.",
  "376": "Lebedian, the city of Tambov governorship. There are fair at the arcade on the day of the Epiphany, the Holy Trinity and the Protection of the Mother of God, which brought goods from different cities, Russian merchants cloth, silk and paper and all sorts of petty matter; and townsfolk cattle, horses, food and wooden utensils; osoblivozh nice around here Fair horse trading.",
  "618": "seed, from 1779, the city of Nizhny Novgorod governorship. It is kazhdonedelno Thursday trading, which brings all sorts of edibles peasantry and other petty commodities.",
  "423": "MEREHVA, town and county of Kharkov governorship. There are fair on June 24, August 6; petty trade merchants, goods, wine, beer, honey and other things.",
  "76": "BUDICH, place in Yekaterinoslav region Polotavskom County. In the hold is the year in excess of the weekly Torzhok, two fairs: one on July 8, and the other day on September 26.",
  "567": "Putyvl, the city of Kursk governorship. In it, apart from the weekly on Mondays and Fridays Torzhok, is one of the year on the tenth Friday after Easter Fair.",
  "157": "Glebova, village and county Yaroslavl governorship. In the hold is the annual fair in September to 8th day; Torzhok week to Sereda. At the village Kupetsky people come from Yaroslavl, Romanova, Uglich, Borisoglebsk, fish and izsel with small farmers to sell goods.",
  "193": "DMITROVSKAYA fortress Yekaterinoslav region. In the case thereof, of the year three fairs.",
  "33": "Basan, of the same town and county governorship. In the hold, except for the weekly Monday trading, is a year pyatyarmarok: the first day of the Ascension, the second day of St. Peter and Paul, the third day of the Assumption of Mary, the fourth on September 20, the day of St. Eustache, fifth December 6 on the day of St. Nicholas. Traded on the add various petty goods and imported from the Don Cossack villages finely fishes. Residents sell cattle, horses, bread, tar, hot wine and other; also brought here for sale to residents Crimean salt.",
  "648": "SPAS in Coachman, a village in Vologda Viceroyalty Avnezhskoy parish. It is negotiating on Tuesdays.",
  "187": "Crake, suburb of Kharkov governorship and counties. There are fair on September 26, of January, 1. They trade merchants various petty Lavochne goods, wine, beer, honey and other things.",
  "92": "BELOTSERKOVKA, place in Kiev Viceroyalty Myrgorod County. In the hold is in year two fairs in one-tenth of Friday, July 27 the other day. Traded on the add and weekly Torzhok visitors from county residents various petty goods tamo Rodia and do, kak some bread, hot wine, various cattle, tar, sheepskins, skins and so on. sometimes come and Great Russian merchants with red merchandise.",
  "127": "Voskresensk, the city of Moscow Province. In it, except for the weekly Sereda and Saturdays trading days, is at ascended s day annual fair.",
  "435": "Mikhailovka settlement Kursk governorship. In the case thereof in one year's fair on the day of St. Peter and St. Paul, to which all Ukrainian cities come with a variety of goods merchants.",
  "252": "merrymaking, village and county Yaroslavl governorship. In this and the village is an annual fair in the month of September; Merchants from near cities like - that Yaroslavl, Rostov, Romanova, Uglich, Borisoglebsk, fish, and Mologi Norsk settlement.",
  "335": "nettle or KROPIVNA, the city of the same governorship. In the city there are two annual fairs: the first day of Pentecost, the second day of July 1; and one in the county thereof; ordinary trading in each week for two.",
  "637": "Slobodskoy, from 1781, the city of Vyatka governorship. In the hold of trade conventions, except Lavochne sale, there are five: the first fair in the fifth Sunday of Lent, the second to the tenth Sunday after Easter, third and fourth in July and in September, while bringing to the city from different places of the holy image, feeding November 24, the day of Catherine the Great; yes in the county in the villages thereof Kinchin, Syryanah, Balezin, Ozlovitskom and five Volchevskom same.",
  "23": "Arkhangelsk, Zmeevka tozh, a village in the Ryazan governorship Donkovskom County; in the hold are in year two fairs: On February 2, the day of the Presentation of the Lord, and the second on November 8, the day of the Archangel Michael. Here come the merchants with various petty. goods.",
  "488": "Olekminsk, the city of Irkutsk governorship. In the hold there are fairs in July and August.",
  "425": "Meshchovsk, the city of Kaluga governorship, here is one of the year Fair July 29 days; auction lasts three days; on the judges come from different cities of the merchants with all sorts of goods, and for the most part peasants with hemp and bread.",
  "447": "Mostovskoi, Ufa governorship village in the Chelyabinsk district. There is an annual fair on the day of the Ascension and 21 November; add-on petty bargaining produce different goods.",
  "594": "Rylsky, the city of Kursk governorship. In it, apart from the weekly on Mondays and Fridays trading happens in year two fairs: the first on the tenth Friday after Easter, and the second day of Our Lady of Kazan in the July 8 numbers, one day lasting, which attracts from devious places with small goods.",
  "84": "Belgorod, Kursk governorship. In the hold there are three annual fairs: the first after the Holy Week in the tenth Friday, the second day of the Apostles Peter and Paul, the third day of the Assumption of the Virgin; Yes thereof in the county of the city are the annual auction in the landlords large villages in the Peter Matsveva in Trinity Matyushkina in Sabyninoy Brylkin, Shebekino Count Genrikova in Alekseyevka Korchiyuk tozh, ekonomicheskoy in Zimoveyke Belay and Prince Troubetzkoy, in Efremovka Gersevanov in Kozmodemyansk Kamyshino , Mikhailovka, Bekoryukovka tozh, Bekoryukova in Ascension, Ivanivka tozh, Baksheeva. Merchants trading on these should come from the near lying cities with petty Lavochne goods.",
  "26": "Atemar, village Penza governorship in Saransk county. There is fair in the last days of the month of July; bring different petty merchants silk goods.",
  "196": "Donkey, the city of Ryazan governorship. There are two fairs a year: the first Friday of the tenth, the second Friday of the second week after Easter nadesyat. These should come to the petty traders with different goods.",
  "179": "Gryazovetz city Vologda Viceroyalty. It devious villagers gather for petty bargaining every Monday and every day sell victuals for travelers; beyond this inhabitants thereof as Mister and woman exercising in knitting stockings and Waregem for sale at retail and on a row.",
  "591": "Rybinsk, Yaroslavl city governorship. There are two annual fairs, one Peter, June 29, another of the Transfiguration, August 6 day, yes povsyanedelnye Torzhok on Saturdays. Kupetsky people come to discharge the same from Yaroslavl, Romanova, Uglich and from the villages to the chandlery and other things, and trade in timber Especially the arcade; and farmers brought their growth and crafts.",
  "214": "dace, the city of Oryol governorship. There are Torzhok in Argamach Quarter September 8 day, and in his county in the village Podvorgalskom May 21, at TeshevskomZadonskom Mother of God Monastery July 23 day, in the village of Petrovsky June 29, in the village of Tyurtene July 8 day. On these fairs trade Elets merchants and other towns with county townsfolk all sorts of different petty goods, and sell to merchants and inhabitants of his brother horses, cattle, canvas, and all sorts of edible supplies and needlework.",
  "777": "SHARTOLINSKOY Mykolaiv, monastery Volodimerskogo governorship in the county town of Shuya. Fair happens here on May 9; foreign trade merchants Lavochne goods.",
  "265": "Joseph's Convent, Moscow province in the Ruza district. Beside thereof monastery is the annual fair of the day July 20; petty trading different commodities.",
  "558": "PREZMA, place Polotskogo governorship in the county town Dinaburga. In this place there is a fair one year; Riga Palace peasants sell various petty goods, wine and beer.",
  "743": "Horol, since 1782, the city of Kiev governorship. In the case in the hold, four fairs: the first on May 9, the second on August 15, the third 29 June, the fourth on November 21; traded on the add immigrants from different county residents petty goods, there Rodia, kak some bread, various cattle, hot wine, sheepskin hides iproch. Sometimes come and Great Russian merchants with red goods; here there are also weekly auction.",
  "344": "Krasnopol, town of Mogilev governorship in Cherikov County. There are four fairs a year.",
  "428": "MYRHOROD, the city of Kiev governorship. In the case in the hold, four fairs: the first in the middle of Lent, the other on the Feast of the Ascension of Christ, the third of September 8 On December 6 numbers; trade visitors from the add va county residents Medco different goods, there Rodia and do as - that bread, hot wine, various cattle, sheepskins, hides; sometimes come and Great Russian merchants with red and other goods.",
  "688": "TISKADY, place Polotskogo governorship in the county town Dinaburga. In nembyvaet the year three fairs, of which trade Riga Palace petty peasants different goods, wine and beer.",
  "507": "Island, the city of Pskov governorship. In the hold is in year three fairs: the first in Maie, the second in July, the third of September 14; merchants come from Pskov with paper, silk and other goods in a small number.",
  "751": "Tsybulya, Sloboda Yekaterinoslav region in Elisavetgrad Province. In the case thereof, of the year three fairs.",
  "499": "Orlik place Yekaterinoslav region. In the hold is in year two fairs.",
  "315": "Kolomna, Moscow province city. In it weekly on Mondays and Thursdays for bargaining is collected from the local peasantry and other counties with bread, a sensitive commodity, clay and wooden utensils and various products.",
  "139": "branch, the same place in the governorship Belitsk County. There is a fair of the year in which the trade of different goods.",
  "643": "SALT-Galitsky, since 1778, the city of Kostroma governorship. In the hold is in year two fairs, in excess of ordinary trading.",
  "71": "BOROMDYA, suburb of Kharkov governorship in Akhtyrsky County. In thereof are four fairs: the first week of St. Thomas, the second on June 29, the third of September 1 On December 6; these should come to the merchants of various Russian cities with silk, paper and other goods, brocade, braids, silver dishes and other; traded as cattle and horses.",
  "125": "funnel place in Kiev Viceroyalty Pereiaslavl County. There is a fair one year on the day of Nativity of the Virgin; traded on the add of devious places townsfolk bread, victuals, hot wine, wooden utensils, and other petty.",
  "644": "Soltsy, churchyard Novgorod governorship and counties. Here is the annual congress of the bidding on July 20 numbers.",
  "216": "ELISAVET Grad city Yekaterinoslav region. In the case in the hold, four fairs.",
  "606": "Sarbayeva, village Sinbirskogo governorship in Alatirskie County. There is fair on the day of the Tikhvin Mother of God; Toe come to the fair with all sorts of silk and other goods from Moscow and other cities of the merchants, and peasants takozh.",
  "405": "Unzhe Makarov, the city of Kostroma governorship. There are three fairs a year: the first on July 20, the second of January, 19, the third of March 25 number. These should come to different cities of the merchants with silk, paper and other petty commodities.",
  "296": "CHINA - TOWN, place Yekaterinoslav region in the Poltava district. In the hold of the year there are three fairs.",
  "153": "Glinski, Sloboda Yekaterinoslav region. In the case thereof, of the year three fairs.",
  "165": "Gorki, Mogilev governorship place in Orsha district. There are two fairs a year.",
  "431": "MITYAKINSKAYA, village Don Cossacks. In it every year on the tenth Friday after Easter is fair, where cattle; also bring sluggish fish, canvas, silk fabrics, cloth, tar and hot drinks.",
  "412": "MASLENSKAYA, settlement Ufa governorship in Chelyabinsk district. There would",
  "133": "Vytegra city Olonets region. There are four fairs a year: On February 2, the second on August 16, the third on October 1, the fourth May 9 These are fair established by former Governor Lord NovogoroDskim Sievers.",
  "614": "holy place, settlement Kazan governorship in the county town Tsarevokokshaisk. There is fair in the month of August; traded silk, paper, iron, copper and other commodities also horses.",
  "555": "FIX, village Penza governorship in Saransk county. Fair happens here in late July; bring different petty merchants silk goods.",
  "581": "Rozhdestvensky, a village in the county of Tula governorship of the city of Ephraim. There is one annual Fair on September 21; on the judges merchants from surrounding cities with different goods, and that for the most part with the petty and peasants with their needlework.",
  "25": "Astrakhan city Caucasian region. In this city is fair kazhdoletno; Russian merchants, Armenians and Tatars traded with Persiani, Armenians, Indians and others, various European and Asian goods.",
  "667": "Ships, Kostroma Sloboda governorship in the Galician Province. In the case thereof, of the year three fairs: the first on November 21, the second of January, 6, the third March 25 numbers. Here, horse-trading and bestial skins, also sheepskins, different soft stuff, and most are proteins; also the county town thereof at the church of the Prophet Elijah, which is high, there is an annual auction.",
  "38": "Berezin, or Bereznev, the city of Chernigov governorship. In the hold of the year there are two fairs: the first day of the Ascension, the second on August 15, the day of the Assumption of the Virgin, to whom fairs and weekly auctions in the sale of devious places are brought in by various edible and drinking supplies, and livestock and wooden utensils.",
  "309": "Kozelets, the city of Kiev governorship. In the hold of the year is over ezhenenelnyh Congresses five fairs, which attracts merchants from near Little Russian cities with Lavochne petty tovaramiiz Nezhin and village Baryshevka; bring cloth, takozh sell mulled wine, tar, fishes, salt, various grain and cattle; but for weekly congresses peasantry comes with bread and other. peasant goods.",
  "267": "Kadin, town of Mogilev governorship in Mstislav district. In the hold is fair in one year.",
  "40": "birch, the city of Tobolsk governorship. Here come Tobolsk merchants every spring water, and torguyut tutoshny with Russian citizens, and especially the with Ostyako and Vogulichami; osenyuzh in Tobolsk ago returned.",
  "158": "GNILSKOY, churchyard Pskov governorship in Ostrovsky district. There is fair in Maie month; merchants come from Pskov with different petty goods.",
  "349": "KRESLAVL, place Polotskogo governorship in the county town Dinaburga. In this place there are three fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "669": "Suzdal, since 1778, the city Volodimerskogo governorship. In the hold there are weekly auctions and bolshiesezdy on Saturday, on Sunday and on Thursday; come on those days to Suzdal from the surrounding villages with bread, hay, straw, lykami, sanmi, arcs, matting, myasami, wood and all kinds of small Shchepetov. The county fair thereof are commoner in rural areas: i) in Parsky August 29, 2) the Carpet on December 25, 3) Gavrilovsky settlement on July 4, 4) Ivanov on September 14, 5) Danilov on October 1, 6) settlement of January, Epiphany 6, 7) in Lezhnyov on Semik; Merchants from Moscow, Yaroslavl, Suzdal, Shuya and other places near and silk trade in goods, cloth and other Shchepetina, mostly peasants underlying commodity. In the add rows to the villages are so fair and visit the add trading days.",
  "543": "PODVORGALSKOE, Village Orlovsky governorship in Eletsky County. There is fair the day May 21; this fair trade Elets merchants and other cities with county townsfolk all sorts of different petty goods; townsfolk and merchants sell their brothers horses, cattle, canvas, and all sorts of edible supplies and needlework.",
  "301": "Kliuchevskoi, desert Sinbirskogo governorship in Alatyrskom County. Here is the day of the Virgin of Kazan Fair, which come with all sorts of silk and other goods from Moscow and other cities of the merchants, peasants with their takozh priugotovleniya.",
  "716": "Urazova, Sloboda, Voronezh governorship in the county town Valuek. In the case thereof, in the year seven fairs.",
  "651": "Spirovo, the village of Moscow Province in Volokolamsk district. In this and the village is the annual Fair Nov. 21 days; trade one day different peasant goods.",
  "137": "Vishny Volochok, the city of Tver governorship. In this city, there are three fairs a year.",
  "217": "ELNA, the city of Smolensk governorship. Here is the year two fairs: the first on the first week of Lent on Friday, the second on July 20, the day of the Prophet Elijah; merchants come from near lying cities with different goods.",
  "583": "Romagna, the city of the same governorship. There are two fairs: the first day of the Holy Trinity, the second day in St. John the Evangelist, Sept. 26 days; merchants come from Yaroslavl with petty goods to one of the peasantry.",
  "486": "OKVADSKAYA, Vologda Viceroyalty parish in the county town Yarensk. There is fair Nov. 21 days; buying visiting merchants Zyryanskaya soft stuff.",
  "336": "nettle or KROPIVNA, place in Kiev Viceroyalty Pereiaslavl County. Here is the year two fairs: the first day of the Prophet Elijah, the second day of the Intercession of the Virgin, except ordinary trading. The merchants of these should come to the near lying cities with red Kramnoy and other goods, with glass and wooden utensils, with small villages of Don fishes; residents sell cattle dashadey, bread, tar, hot wine and other; also brought here for sale to residents Crimean salt.",
  "776": "SHARAPAVO, the village of Nizhny Novgorod governorship in Arzamaskom County. Here is one in a year's fair.",
  "611": "ALEXANDROVKA Svirsky, the monastery in Olonets district. When the hold is the annual fair on the day of Pentecost, August 30. This bidding merchants came from different Russian cities with silk, cotton, worsted and other goods.",
  "256": "Illinska village of Tula governorship in Kashira district. There are Torzhok kazhdonedelno Friday in days; Items on these should bring from county linen canvases are different, from the city of Yaroslavl, Uglich Pereslavl KPD and merchants come from all sorts of petty commodities rather poor.",
  "804": "JS, ​​place Polotskogo governorship in Dinaburgsky county, in this place there are three fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "418": "beacons, place Yekaterinoslav region in the Poltava district. In the hold is one of the year Fair.",
  "21": "ARTEMONOVKA, suburb of Kharkov governorship and counties; here are fair on July 8 and November 21, trades petty merchants goods, beer, honey and other things.",
  "339": "Red, Orlovsky village governorship in Livenskom County. In the hold of the year is July 30 Fair. Here come the surrounding towns and merchants commoners with silk and other goods, but mostly petty, and also the peasants with their products.",
  "199": "Dubetsky, churchyard Pskov governorship in Ostrovsky district. There is fair in the month of June; merchants come from Pskov with different goods.",
  "31": "Balakhnev, the city of Nizhny Novgorod governorship. In the hold there every week on Sereda and Fridays, and in the winter and on Sunday trading, which farmers bring more bread, and food for the people of different needs.",
  "505": "sharp, the city of Kiev governorship. In the hold, except weekly on Mondays and Fridays of trading, is in year two fairs: one in the New Year, and the other on the tenth Friday after Easter.",
  "229": "ZADUSHNOE, a village in the county of Tula governorship Novosil city. In the hold village is fair on the day of Pentecost; petty merchants sell different goods.",
  "682": "TENGUSHEVA, the village of the same governorship about Posada Kadoma. There is a year's fair, which attracts traders from nearby cities with silk, paper and other various petty goods.",
  "516": "Penza, the main town of this name governorship. It happens in year two fairs: the first to the seventh week of Easter on Thursday, the second day of St. Peter and St. Paul.",
  "769": "Chechersk town of Mogilev governorship in the county town of Rogachev. There is a year three fairs: the first of January, 8, the second on September 8, the third day of the Ascension.",
  "728": "Fatezh, from 1779, the city of Kursk governorship. It trading day for devious villagers happens on Sunday.",
  "178": "dirtier KOLYUPANOVKA tozh, a village in the Tula governorship Aleksinskiy County. In the hold there are Fair July 8. Here, merchants sell goods to. peasants belonging.",
  "114": "Voznesensky, churchyard Vladimerskogo governorship in Gorokhovsky County. Here is the trading day convention in Ascension.",
  "9": "ALEXANDROVA desert, village and county Yaroslavl governorship. There is an annual fair in the month of June; Merchants with a variety of goods from nearby cities, namely: Yaroslavl, Rostov, Romanova, Uglich, Borisoglebsk, fish, and Mologi Norsk settlement.",
  "694": "Tomarovka, settlement in the county town of Karpov. In the case thereof after Christmas Fair on vseednoy week on Friday, May 9, July 8, 6 December, and these should continue for one day. Merchants come from surrounding cities with petty goods.",
  "652": "Sribne, town Chernigov governorship in Prilutskii County. In the hold is two fairs a year: one on April 23, the day of the Great Martyr George; another 8 September, the day of the Nativity of Our Lady. Add-on peddling their devious residents proizrasteniyami, kak some bread, various cattle, victuals, all sorts of utensils, hay, tar and other petty. There are also weekly Torzhok on Monday and Friday.",
  "799": "Yamskaya Sloboda Penza governorship in Insarskom County. There is an annual fair in the ninth Friday; on the judges come from merchants near lying cities with inexpensive goods.",
  "310": "Kozelskiy, the city of Kaluga governorship. Voiom is fair in the tenth Friday after Easter. Here come nonresident merchants with different goods, silk and cotton, as farmers sell their products pennu, smolchug and potash, oil, sailing yarn; and other trades are weekly on Monday.",
  "639": "Smolensk, 1775 with the main town of this name governorship. In the hold fairs there, and come to the trading days on Wednesday and Friday from different counties with different landlords peasants bread, hemp, honey; And on Sunday, although there peasantry with takimizh goods tokmo small number.",
  "450": "MNSR place Kiev governorship and counties. Here is one in a year's fair; come to the judges with petty goods, edible and drinking supplies.",
  "167": "Mounds, the same place in the governorship Myrgorod County. In the case in the hold, four fairs: the first on May 6, the second on August 1, the third of October 1 On December 6; traded on the add immigrants from different counties residents petty goods, there Rodia and do, kakto bread, hot wine, various cattle, tar, sheepskins, skins and other things; sometimes come and Great Russian merchants with red goods. Here there are weekly auctions.",
  "356": "wings, Sloboda Ekaterinoslavskogo NamestnichestvaV thereof is in year nine fairs.",
  "713": "node, place Polotskogo governorship in the county town Dinaburga. In this place there are three fairs a year, of which trade on the Riga Palace of peasants different petty goods, wine and beer.",
  "742": "Khoperskaya, since 1780, the city of Saratov governorship. In the hold is a weekly auction.",
  "95": "rolls city of Kharkov governorship. There are fairs February 2, May 9, July 27, September 14, December 6. They trade merchants various petty commodity, beer, wine, honey and other things.",
  "37": "BEZGINOVKA, place in Yekaterinoslav region. In the hold is in year six fairs.",
  "491": "Olhovatka, the village of Kharkov governorship in the county town of raisins. There are four fairs a year: the first of January, 6, Epiphany, second and third days on George the summer and winter, on the fourth day of the seventh Martyrs Maccabaeus. Merchants on these should come from different cities with silk, cotton, wool and other goods.",
  "739": "ance, a small village in the Moscow province Volokolamsk district. Here is one in a year's fair in July, which traded one day different peasant goods.",
  "616": "Sedna, town Chernigov governorship and counties. In the hold there in July, the Fair on the 20th day, on which the weekly auction on Friday traded devious residents of bread, horses, cattle, wooden utensils, bacon, honey, fishes and other petty things.",
  "561": "Pronsk, the city of Ryazan governorship. There are weekly on Fridays trading, of which sell all sorts of goods.",
  "168": "Gorodnov, town of Mogilev district governorship in Rogachev. There is a year nine fairs.",
  "174": "Gremyach, Sloboda Tula governorship in Belevsky County. In thereof is two annual fairs: the first day of the feast in the cutting off of the second on the first day of fasting Petrova; these should come to the merchants from nearby cities with different petty goods for the peasantry.",
  "403": "Makarova, the village of the same district governorship in Kerensky. There is fair of the year in the month of July; the judges on the merchants come from near lying cities with petty goods; traded as horses, cattle, and other things.",
  "271": "Kalinkin, a village near the suburb of Tambov governorship Good. It happens here in the year Fair on July 20, which come with different merchants petty goods.",
  "613": "Svyatogorsky, Pskov Monastery governorship in the county town Opochek. When it happens in year two fairs.",
  "131": "HIGH, the village of Moscow Province in Volokolamsk district in which there is a small number, and the hold of every sale made scrupulous product, wooden utensils, bread and drunk,",
  "717": "URALSK, the main city of the Ural Cossacks in the Caucasian region. There are fairs in June, July, September, October, and of January, in the month of February; come to different cities of the merchants, bring bread, silk and cotton goods, woolen fabric, cloth, etc; here buy different genera fish, caviar, glue, steppe animals, kak some foxes, wolves, hares, girdles and homespun cloth.",
  "509": "Ostrogozhsk, the city of Voronezh governorship. In the hold are fair: the first on Easter Friday, the tenth, the second on September 8, the third of December 6. Come to discharge the same Russian and foreign merchants and Greeks; bring brocade and other silk fabrics, cloth, silver and china, clothing and other things.",
  "553": "Porec, a village in the Tver governorship Bezhetsky County. Here, in addition to the annual fairs are weekly Torzhok, which inhabitants of the county bring any bread and other syreynye and edible products.",
  "325": "Korowai, a village in the Kiev governorship Lubenskiy County. In the hold is fair after Easter Sunday on the tenth Friday.",
  "239": "Zolotonosha, the city of Kiev governorship. It happens in year four fairs: the first in Fomin week, the second day of the Descent of the Holy Spirit, the third day of the Nativity of the Virgin, the fourth in December 6. The merchants of these should come to the near lying cities with red Kramnoy and other goods, glass and wooden utensils and smallest of the Don Cossack villages fishes; residents sell cattle, horses, bread, tar, hot wine and other; also brought here for lrodazhi residents Crimean salt.",
  "18": "APICHERSKAYA, desert Sinbirskogo governorship in Alatyrskom County; Here is a day Kavanskiya Fair Lady. At this very fair come with all sorts of silk and other goods from Moscow and other cities of the merchants, and peasants takozh.",
  "205": "DUKSHTILAG, place Polotskogo governorship in Dinaburgsky County. In this place there are two fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "227": "ZHOVNIN, place in Kiev Viceroyalty Lubenskiy County. Here is the year two fairs: one vden Ascension of Christ, the other day on September 1.",
  "413": "Maslovich, town of Mogilev governorship in Mstislav district. There is a fair of the year.",
  "246": "Ivanovo, village Vladimerskogo governorship in Suzdal district. There is an annual fair on September 14 the day on which the different cities of different merchants peddling petty merchant goods.",
  "560": "Priluki, Chernigov city governorship. In the hold is in year four fairs: the first of January, 1, the second Easter Sunday a week Fomin, tretiyaIyulya 24, the day of the Great Martyr Demetrius. Trade fairs for the add residents with visiting vessels bread, cattle, horses and sheep, hot wine, fishes, salt, tar and various of brass, glass, clay and wooden utensils; also come from Great Russian and Little Russian cities with merchants Lavochne goods, cloth, silk fabric, silk and other red things.",
  "29": "BAEVKA, a village in Siberia at the top of the river Sviagi; in the hold every Sunday is bargaining.",
  "579": "ROGACHEV, the city of Mogilev governorship. In the case in the hold, four fairs.",
  "580": "ROGACHEVO, Ekonomicheskoe village Moscow province in the Dmitrov district. In the hold ranks there and Torzhok, and is in year two fairs: the first on May 9, the second on the tenth Friday.",
  "245": "Ivanovo, Tula village governorship in Kashira district. There is Fair June 29 days; the judges on the products on sale are brought from Kashira, Tula, Serpukhov, Venev from Zaraysk on a small number of petty moskotilnye and food, and the inhabitants of the county for sale is hemp, honey, wax, wood products.",
  "142": "GABZAL city Revel governorship. It is one in a year's fair.",
  "457": "MSHAGA or MSHAZHSKOY, churchyard Novogorodskogo governorship and counties. In the hold is the annual congress of trade on Friday, the day before St. Prophet Elijah.",
  "740": "hill at the Savior, a village in the Tver governorship Bezhetsky County. Here is the weekly auction on Tuesday, in which county townsfolk bring any bread and other syreynye and edible products.",
  "67": "Borispol, Kiev Viceroyalty place in Pereyaslav district. In nembyvayut the year three fairs, of which visitors from devious those places sell different bread, petty commodity, fishes, salt, cattle, and so on.",
  "437": "Mishurin EGR, trench Yekaterinoslav region. In the hold is in year three fairs.",
  "363": "KUNGUR, the city of Perm governorship. In this city during the holidays are to trade conventions of January, 4, October 28 and in the ninth Friday after Easter.",
  "693": "Tobolsk, 1782 with the main town of this name governorship. Russian merchants, in Siberia and the Chinese border trading, Tobolsk not bypassed. Winter on both sides have travel incessant; spring sent rivers on ships and Eniseisk to Irkutsk, and in the fall there is water coming through. And it happens in Tobolsk Fair twice a year: in the spring of Russian and autumn Siberian and Chinese goods. Merchants have another visit with products from Irbit Fair and bargaining contain March from 20 May to 25 numbers, including the Greeks and come.",
  "337": "Krasnoborsk city Vologda Viceroyalty. In this city, there is a small fair; n coming merchants from different Russian cities with mlochnymi goods.",
  "109": "VERHOVAZHSKOY, plant Vologda Viceroyalty. There is fair about the 15th day of the month of March rub days. Stop here merchants with goods traveling with the Annunciation Vazhenskoy fairs; also gathers there and peasants with their preparedness is for sale.",
  "503": "Ostap place in Kiev Viceroyalty Myrgorod County. In the hold is in year four fairs: the first of January, 30, the second on April 21, the third 24 June, the fourth on September 20; traded on the add immigrants from different county residents petty goods, there Rodia, as - that bread, hot wine, various cattle, sheepskins, skins and so on. sometimes come and Great Russian merchants with red merchandise. There are also weekly Torzhok.",
  "278": "Êàî or shorter, the city of Kursk governorship. In the hold, except for two weekly auctions, sometimes six annual fairs: the first day of the Nativity of the Virgin, the second in the winter St. Nicholas Day, the third in the New Year, the fourth in the spring in St. Nicholas day, the fifth of July 8, the sixth in the Assumption Day. Add-on merchants peddling small red variety of goods, and the townsfolk bread, bristles and hemp canvas.",
  "787": "Shuya, from 1778, the city Volodimerskogo governorship. There is an annual fair on July 24, called Boris and Gleb; Yes thereof in the county in the paternal Shartolskogo Nicholas Monastery in the village of navel merchants sell domestic and foreign goods.",
  "319": "Konobeevo, the village of Tambov governorship in Shatsk County. In the hold of the year is June 24 day fair, which sell hemp, canvas, wool and other things.",
  "541": "Pohar city Novogorodskogo - Seversky governorship. There are three fairs a year: the first and second Nikolsky, and a third of the Assumption on August 15th.",
  "305": "Carpets, city Vladimerskogo governorship. There is an annual fair on December 25. Come to the judges merchants from different cities with petty goods.",
  "351": "KRIVONAVOLOTSKAYA, a village in Vologda Viceroyalty Yarensky County. There is fair of January, from 6 to 13 the number; thereof, on the most part buy commercial fish farmers.",
  "727": "Uholovo, YAKIMTSOV tozh, village and county Riga governorship. In the hold of the year there are three fairs that merchants come from nearby cities with silk, paper, and other goods moskotilnymi not in a larger number, but more farmers sell canvas, wheels, wooden utensils and other things.",
  "659": "Starodub, from 1782, the city Novogorodskago-Seversky governorship. In the hold of the year there are fairs, one in the second week of Lent, and another after Easter Sunday at the tenth; traded on the add and ordinary weekly torzhhi small red goods, cloth, silk fabrics imported from other neighbors' places. The merchants of this city sends to the ports of Riga and SaintPetersburg and hemp ropes, and a devious place wax, flax stubble, hemp oil, resin, matting, different wood, glass, crystal dishes and mulled wine.",
  "670": "SUMY divination, suburb of Kharkov governorship in Sumy district. In the case in the hold, four fairs; merchants come from surrounding cities with petty goods and hot wine, also victuals.",
  "10": "Alexandrovsk tozh Cherkasky, a village in the Penza governorship Kerensky County. There is a fair year in the month of June; merchants come from near lying cities with different petty goods; traded as horses, cattle, and other things.",
  "77": "BURETSKOY, churchyard in the Novgorod district. Here is the annual congress of the bidding in the ninth Friday after Easter.",
  "649": "Spaska, from 1779, the city of Tambov governorship. It is an annual fair in the tenth Friday after Easter, which came merchants from nearby cities with petty commodity and trade only one day.",
  "763": "Chernavskii, Sloboda, Voronezh governorship. Here is one in a year's fair on the day of the Presentation of the Vladimir Icon of the Mother of God, that is the day on June 23; on the judges come from nearby cities merchants with small goods, and continues onaya only half a day.",
  "54": "Bogoroditskaya, the city of Tula governorship. In this city is fair on July 7 and 8, the day on which the city of Tula, Epiphany, Kropivny, Dedilovo, Ephraim, and brought Donkova petty red items and add-cities of the county farmers Wheels and Lucky.",
  "126": "Vorontsovka, the village of Count Vorontsov in Tambov governorship about the settlement of Good, Here is a weekly Congress for trade; merchants come here, but only bring petty goods.",
  "504": "Ostashko, the city of Tver governorship. There are three fairs a year.",
  "280": "Qasim town of the same governorship. It is fair July 8 days; thereof on the trade coming to a pilgrimage to the Kazan Nunnery.",
  "334": "Koshiro, the city of Tula governorship. There is an annual fair on the day of the Ascension in Maie month, but petty trade in goods.",
  "64": "Borisoglebskaya, the city of Yaroslavl governorship. There are fair on the day of the Holy Trinity and St. John the Evangelist on the day; Torzhok and weekly on Saturdays. In these should fairground and Saturdays with goods merchants did not come, and come mostly living in the vicinity thereof settlement peasants and other commoners, and bring bread for sale, dining stocks and make them a wooden and other dishes.",
  "430": "Mirotin, Tula village governorship in Kashira district. In the hold is July 20. Fair merchants brought goods for sale from Kashira, Hoods, Serpukhov, Venev and Zaraysk on a small number of moskotilnye and petty and food; inhabitants of the county for sale is hemp, honey, wax, Dereviny products.",
  "22": "Arkhangelsk, the main town of this name governorship. It happens every year, Fair, which starts at Maie month with the arrival of the Russian barges and ships from overseas; straight away, or gross always begins in June and ends in early October; It happens to the trade between foreign and Russian merchants of Russian and foreign goods continued during navigation on which the fair foreign merchants all sorts of foreign goods through the sea in ships from foreign parts to bring the port of Arkhangelsk; Russian and in those places let all sorts brought in by horseback through the city with water and dry by Russian, Chinese, Persian, Turkish, and other Asian and other foreign goods for national consumption, rather than drove into the wrong region, namely the same: wine brought in by French, Portuguese , and German gishpanskogo better and ordinary, rum, vinegar, vodka Hungarian, Elixir, wine, stone, cloth, Dutch, Aglinskiya, the Hamburg, Shlezskiya and other better and ordinary, rags and cloth pokromi, stamedy, damasks and other similar woolen fabric; damasks and other silk and semi-brocade belt vyboyki, paintings Dutch, tin dishes and torelkah and other medochah, Coated and bullion, lead, iron sheet, needles, knives, forks, scissors and other iron products; alum, mercury, sulfur combustible, shelak, shpiater, wooden oil, figs, raisins, currant, figs, prunes, yadry migdalnye, coffee, tea, pepper, nuts ink, sandalwood, sugar, lemons, oranges and other fruits and fresh wine; cloves, cinnamon and other spicy potions; Kanthare, palm dewy and simple, different varieties of gum; glassware, Tsenin and stone, glass and bottle okonchinnye, cheese, black molasses, wheat sorochinskoe, paper lantern, beavers, otters, foxes; paint Conseil squared, cinnabar, orinak; stockings silk and wool, and also other holiday like - that bread, flax seed, beef tallow and burst resin Russia leather, iron and nails lane iron, hemp, county, bast mats bags; bristles, ropes and rope hemp and pakalnye, yarn rope, wax, mane of horse, bones, skin morzhevye, soap; furs, martens, gornactai, wolverine, squirrels, foxes, Zaychino, Belli and hare skins, leather bear, wolf and koshechi; fabric is smooth and wide and the tissue uzkiya and abuse of the county work Flamskiya sailing and ravenduk canvas, cartilage, wooden utensils, candle tallow, smoked beef tongue, lip hardwood, glue Siberian, podoshevnye skin and burst, homespun cloth and CHirkova shoes, teas and Shrike simple, star anise, butter flax and hemp, raw honey, deer antlers, meat salted beef, salmon, salted, honey cakes.",
  "574": "RATSBURG, paternal Menshikov in Yekaterinoslav region. There are two fairs, namely: the first Trinity, which had previously been in Lebedinsky Trinity Monastery, and transferred to Toe paternal; and the other in the same paternal Intercession, and in October of the day; and moreover there are weekly and temporary Torzhok, on koi come from nearby cities merchants and peasants from the counties with bread and other stuff.",
  "396": "Lubavitch town of Mogilev governorship in Babinovetskom County. It is one in a year's fair.",
  "191": "Dmitriev, the city of Moscow Province. In the hold is in year one fair, which begins 15 September and lasts for a week; with the goods come from different cities closer, namely from Moscow of Pereslavl KPD, from Yaroslavl; of Katina and from adjacent areas. Goods are to discharge the same Shchepetov, hats, boots and other junk; also trading days in the week, there are two: Monday and four current.",
  "263": "ISTALENA, place Polotskogo governorship in the county town Dinaburga. In this place there are two fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "436": "Mikhailovsky churchyard Pskov governorship in the county town of the island. Here is the year two fairs in September and November; merchants come from Pskov with different petty goods.",
  "32": "Baryshevka, Kiev Viceroyalty place in Pereyaslav district. In the hold of the year there are three fairs: the first of January, 1, and the second on May 9, the third of September 11 numbers, where merchants sell various petty goods and imported from the Don Cossack villages finely fishes; and the people selling cattle, horses, bread, tar, hot wine and Crimean salt.",
  "290": "Kirensk, the city of Irkutsk governorship. Been here a year and daylight time Fair, which many merchants bidding to move out, but the decline of the local inhabitants left.",
  "608": "Svatovo Lucky, suburb of Kharkov governorship in the county town of raisins. In the case thereof, of the year two fairs: the first on June 8, the day of Theodore the; the second on September 26, the day of St. John the Evangelist; prieezhayut to discharge the same merchants from different Russian cities with silk, cotton, wool and other goods.",
  "202": "Dubrovka village of the same district governorship in Temnikov. Here is one in a year's fair, in addition to weekly auctions, the seventh week after Easter Tuesday. Here come the merchants from the surrounding towns with silk and paper products, bread and other supplies.",
  "223": "ESKE, a village in the Tver governorship Bezhetsky County. There is an annual fair; come to the judges with petty merchants Lavochne item.",
  "631": "SIMEONOVKA, place Novogorodskogo - Seversky governorship. In the hold is in year three fairs that come from places devious merchants with krasnyni and other petty commodities; There are also weekly and Torzhok.",
  "458": "Myshkin town of Yaroslavl governorship. It is an annual fair in the month of May. Merchants from near cities like - some of Yaroslavl, Rostov, Romanova, Uglich, Borisoglebka, Rybinsk, Mologa and Norsk settlement.",
  "377": "LEVKOY, Monastery Moscow province in the Volokolamsk district. There is an annual fair on August 15 days.",
  "162": "GOMLYA, place the same governorship in Rogachev district. There is a three-year fair.",
  "512": "Parsky, village Vladimerskogo governorship in Suzdal district. In the hold is one annual Fair Aug. 29 days; way to sell various petty Kupetsky goods.",
  "93": "Belynichi, town of Mogilev governorship. There are four fairs a year.",
  "83": "White Kolp, the village of Moscow Province in Volokolamsk district. In this and the village is one of the year Fair Aug. 19 days; trade one day different peasant goods.",
  "388": "Lokhvytsya, the city of Chernigov governorship. There is a four-year fair: the first day in the cutting off of the second day Martyr Procopius, the third day of Saint Eustace, in the fourth week vseednoy; these should come to the merchants of the Russian and Little Russian cities with red goods from the skins, iron and other things.",
  "327": "Korotoyak, the city of Voronezh governorship. In this city, there is a fair one year of July 8, the day of the Kazan Mother of God; bring to a small number of the judges of silk and paper goods, and more peasant products.",
  "511": "Pavlograd city Yekaterinoslav region. There are three fairs a year.",
  "330": "Kostyukovichi town of Mogilev governorship in Klimovitskiy County. There are two fairs a year.",
  "210": "Dedinovo, Moscow Province village in the county town of Kolomna. It has two rows of them in the same trade sestnymi supplies, and the other in spending time weekly on Friday auction sold there the townsfolk imported from Kolomna scrupulous different goods, and from different villages every bread.",
  "409": "MALYKOVA, place Polotskogo governorship in the county town Dinaburga. In this place there is a fair one year; Riga Palace peasants sell various petty goods, wine and beer.",
  "714": "Ulomov, a village in the Yaroslavl governorship Poshehonsky County. There is an annual fair at Whitsun, and lasts two days.",
  "483": "ODINTSOVO, Tula village governorship in Kashira district. In the hold is fair during the tenth and eleventh Friday; Items on sale are imported from Kashira, Tula, Serpukhov, Venev, and Zaraysk on a small number of petty chandlery; of the inhabitants, in the county prodazhebyvaet hemp, honey, wax, wood products.",
  "660": "old Byhov, since 1778, the city of Mogilev governorship. There are two notable year in the fair, which come from the Ukraine and merchants.",
  "46": "the Annunciation Parish, a village in the Arkhangelsk governorship about Vizheva. There is fair in early March, according to what is called and Evdokeyskoyu and reputed Vizhevskaya Annunciation; merchants come to the judges of all the commercial cities of Arkhangelsk and the governorship of the neighboring provinces. There is a wooden living room courtyard with many shops and inns huts for coming to this very fair merchants.",
  "295": "KISTRUSA, village and county Ryazan governorship. In the hold is fair on the day of Pentecost, but traded tokmo peasants.",
  "247": "Ivanovo, Tula village governorship in Kashira district. There is fair Sept. 23 days; the judges at the fair products on sale are brought from Kashira and Tula, Serpukhov, Venev of Zaraysk on a small number of petty moskotilnye and others, as food; and the inhabitants of the county for sale is hemp, honey, wax, wood products.",
  "571": "PYATNITSKOE that Berendeevo, the village of Moscow Province in the Resurrection County. In this and the village is one of the year Fair, which traded the little things.",
  "502": "Oskina, a village in the Voronezh governorship Korotoyak County. Here at pervoynadesyat week after Easter Friday is fair selling silk and paper goods Chmel small; and for the most part peasants come with their goods and products.",
  "284": "Kerensky, the city of Penza governorship. In the hold there are two fairs a year: one in June and one in July, and last, the first day, and the other two over kazhdonedelnyh trading. Merchants on these should come Kadomonskie, Kasimov and Arsamazskie different petty goods.",
  "732": "Hamina, from 1784, the city of Vyborg governorship. In the hold every summer is fair, as in the seaside town; let go of the sea board, resin and some iron, and get themselves out salt, tobacco, wine, etc., these things happen over a year and another Fair on August 24.",
  "78": "BUROMKA, place in Kiev Viceroyalty Lubenskiy County. In the hold there are two fairs a year: one on July 24, another number 1 November.",
  "299": "Kiat, the village of Kazan governorship in Sviazhskom County. In the hold is in fair every year in the month of June for five days. Here come the different cities of the Russian merchants with Russian and foreign goods, are also changing and buy horses.",
  "91": "Belopole, the city of Kharkov governorship. In the hold are fair: the first of January, 6, the second on June 24, the third day of September 14; traded on the add various petty commodity, horses, cattle, hot wine and so on.",
  "620": "Sękowa, suburb of Kharkov governorship in the county town of raisins. In thereof are two fairs: the first on May 9, the day of Nicholas the Wonderworker, and the second on August 29, the day of the Beheading of the Baptist; these should come to the merchants of various Russian cities with silk, cotton, wool and other goods.",
  "222": "EREMEEVKA, place in Kiev Viceroyalty Lubenskiy County. There is a year four fairs: the first day of the Lord cutting off the second day of Peter and Paul, the third day of St. Demetrius, the fourth of vseednoy week.",
  "477": "Nosovka, town and county of Kiev governorship. In the hold town is in year three fairs.",
  "343": "Krasnokutskaya, the city of Kharkov governorship. There is a four-year fair: the first post of the Cross week, the second on April 23, the third 29 June, the fourth on November 21; these should come to the merchants of various Russian cities; bring silk and other goods, braids, silver ware and other; immediately sell cattle and horses.",
  "719": "ASSUMPTION, Volodimerskogo governorship churchyard near the settlement Yaropolets. Vsem village is fair on the feast of the Assumption of Mary, and the weekly auction on Mondays.",
  "141": "VYAZOVNA, village and county Sinbirskogo governorship. In the hold there every week bargaining,",
  "13": "Alekseevskaya fortress Yekaterinoslav region on the Dnieper line; thereof, are in a year three fairs.",
  "86": "White, a village in the Yaroslavl governorship Poshehonsky County. There is an annual fair in Troytsyn day and lasts two days.",
  "43": "Bernik, Tula village governorship in Kashira district. During the tenth and eleventh Fridays here is fair, fair koyu goods on sale are brought from Kashira and near Tula, Serpukhov, Venev and Zaraysk on a small number of moskotilnoy, and other sundries, and food, and more than the inhabitants of the county is Sales hemp, honey, wax and other products.",
  "331": "Kotelva, suburb of Kharkov governorship in the county town of Akhtyrka. There are four fairs: the first of January, 1, the second on March 25, the third day of Troytsyne fourth Sept. 8. The merchants come from different Russian cities, bring brocade, silk goods, braids, meshes, silver ware and other; traded as cattle and horses.",
  "578": "Riga, the capital of governorships this name. In the hold is annually one fair, which lasts from June 20 July 10 number; gather different kramschiki from Germany and some of the neighbors' manifakturschiki countries. Vrazsuzhdenii this fair only to notice it follows that visitors to kramschiki thereof and manifaktur crates in the continuation thereof imot freeness of their products in the open Crush hold, home wear, onyezh who want as philistines and foreign produce on sale; and after the lessons that life should they unsold products are not driving around with onymi by counties or other domestic cities, take back with him back, or put in a marble warehouse, from which those remaining goods otherwise than Riga burghers in bulk to sell them willingly. However, foreign kramschiki and manufakturschiki reverse buy goods here are not taken, and drive off with the proceeds here for their goods sold in cash.",
  "264": "ICHNA, town Chernigov governorship in Prilutskii County. In the hold is in year three fairs: the first in the first week of Lent, the second in the first week of fasting Petrova, the third on July 20, the day of the Prophet Elijah. Add-on peddling their devious residents proizrasteniyami like - that bread, various cattle, victuals, wooden utensils iprocheyu peasant trifle. Here, too, there are also weekly Torzhok on Monday and Friday.",
  "678": "Tarus, since 1777, the city of Kaluga governorship. In the hold is the annual fair on the day of Saints Peter and Paul Aposgpol; come to the judges with small merchants and edible goods from near Serpukhov and Alexina and county people with farming supplies.",
  "257": "INZHAVENE, village different landlords Tambov governorship in Shatsky district. There are fair in the ninth, tenth and eleventh Friday to Easter; add-on trade merchants canvas, hemp and others.",
  "687": "TIM, from 1779, the city of Kursk governorship. In the hold is two fairs a year: in the first eleven Friday after Easter, the second day of the Nativity of the Virgin, which attracts more and Kursk Starooskolskaya merchants with cloth and silk fabrics.",
  "192": "Dmitrovka Olshanka tozh, a village near Kiev Viceroyalty Yabluneva settlement. Sometimes there is one annual fair, where merchants come with a variety of goods.",
  "16": "Andreevka, suburb of Kharkov governorship in Izyum district; thereof in the case of the year two fairs: the first on July 20, the day of the Prophet Elijah, the second on October 26, the day of the Great Martyr Demetrius. Merchants on these should come from different cities enter the Russian silk, cotton, worsted and other goods.",
  "498": "ORENBURG, the city of Ufa governorship. In this city, the fair is on daylight saving time Menovnoe yard, that is, outside of the city, when Asian merchants and Kirgis-Bothrops atrox come to a Russian merchant at different Russian and foreign goods produced barter, giving instead thereof and spinning cotton, paper and semi-gowns , vyboyku; calico beduyu and dyeing, chaldary white, horses, sheep, camel wool, volkov, foxes, Korsakov's coat, coats and so on.",
  "786": "zhung, churchyard Olonets region in Povenets County. In the hold of the year there are two fairs: the first of January, 6, and the second on March 25, to come koi merchants with silk, cotton, worsted and other goods.",
  "449": "MOSHEYKA, Village of Kaluga governorship in Kozelsk district. Here are trading days kazhdonedelno on Sundays; these should come to the merchants of the Kaluga Province of Kaluga and Meshchovsk, also from Bolhova, Beleva and other cities; bring products meskotilnye, there are a few silk paper and other varieties of matter, but for the most part the county farmers bring different county goods, any bread, hemp, oil, honey, wax, voschinu, sailing weft yarn, canvas, linen, homespun and other peasant crafts and other petty commodities.",
  "598": "RJaZAN, the main town of this name governorship. In it, apart from the weekly on Sundays and Fridays Sereda trading, there are two fairs a year: On July 2, the second on August 29 numbers on whom the merchants trading in silvering series crosses, rings, Sergey and salaries, but in different moskotilnom Kamke, silk braid, gold and silver nets vyboykoyu, cotton paper and writing and victuals; takozh bidding depart from raw skins, honey, raw, bristles and lambskin.",
  "317": "Komel'sk Cornelius, a monastery of the city of Vologda to 45 miles. When it happens twice a year's fair. First on the Feast of the Blessed Virgin Mary, and the other of January, 17 days; for which there are built and series. On these fairs Moscow, Yaroslavl, Kostroma, Lyubimsky, Romanov and Vologda merchants there, some of which brought silk, worsted, cotton, moskotilnye and other goods; is also going to settlers from Vologda, Galich, Lyubimsky, Kostroma, Yaroslavl and Poshehonsky increasing number of counties with a linen canvas and cartilage, with woolen stockings, with beef skins and fat, with sleds, wheels and other petty commodity; Nor is smaller bargaining and horses; and sell two or three days in succession.",
  "260": "IRKUTSK, the capital of governorships this name. There are two fairs a year: the first from March 15 to May 1 second of January, from 15 November to 1, which is in the sale of a variety of Russian and Chinese goods between Irkutsk and nonresident merchants.",
  "366": "Kuryanovo, place Polotskogo governorship. In this place there is a fair one year; Riga Palace peasants sell various petty goods, wine and beer.",
  "218": "Yenisei, the city of Tobolsk governorship. In the hold is fair once a year at the beginning of August. There are merchants here on the water path from Tobolsk and Irkutsk, some of whom exchanging the goods, in the same way back come back, and other intentional water your way further produce.",
  "772": "CHUPAHOVKA, settlement near the former town Aleshnya. In thereof are three fairs: the first on April 23, the second on September 8, November third 21 days. These should come to the merchants from near lying cities; trade cloth, silk, paper and naboychatymi goods, iron, linen, dishes and stuff.",
  "588": "outer, a village near the city of Oryol governorship Karachev. In the hold is Fair May 2nd day; petty merchants traded goods.",
  "760": "CHEREPOVETS, from 1776, the city Novogorodskogo governorship. There are three annual fairs: the first of January, 11, called Feodosievskaya, the second on September 25, Sergius, the third November 26, St. George's. Here come the merchants from different Russian cities with different goods.",
  "90": "BELOKURINA, Sloboda, Voronezh governorship in the county town Valuek. In the case thereof, of the year two fairs.",
  "411": "Markushevski, Ekonomicheskaya village Archangel governorship. There is Fair July 8th day; merchants come from nearby cities with different petty moskotilnymi and other goods, and buy from them krestyan priugotovleniya and sometimes soft stuff, too fat, canvas and so on.",
  "81": "Bulls, town Chernigov governorship in Pyryatynsky County. There is a four-year fair: the first day in the cutting off of the second on August 1, the third on October 14, the fourth of November 23. Beyond this there Torzhok kazhdonedelno Monday; traded on the add various petty goods and brought in by the fairs of the Don Cossack villages fishes; residents sell cattle, horses, bread, tar, hot wine and more. Also brought here for sale to residents Crimean salt.",
  "734": "Kharkiv, since 1780 the main town governorship of this name. In the hold there are four fairs: the first day of Pentecost, the second on August 15, the third on October 1, the fourth of January, 6 days.",
  "173": "GREBENISHKI, place Polotskogo governorship in Dinaburgsky County. In this place there are two fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "80": "BUSHNRVO, a village near Kostroma governorship Parfentieva settlement. In this and the village is in year two fairs: the first to the tenth week of Easter, the second of July 8; these should come to the merchants from near lying cities with different petty goods.",
  "285": "Cesme, a village in the district governorship of Tver city Bezhetsk. There is one annual fair; come to the judges with petty merchants Lavochne item.",
  "383": "Liptsy, settlement in the county of the city of Kharkiv. There are fairs May 9, June 29, September 1, December 6; petty traders sell various goods, honey, beer, wine and other things.",
  "269": "KAZAN Bogoroditskaya, Monastery of Penza governorship, from the city Nizhelomova and a half miles. There is an annual fair on July 1, and the number continues to 9 togozhe. months.",
  "623": "Serdobskiye with 178o, the city of Saratov governorship. In it, apart from the weekly speculations happens yearly July 8th Day Fair.",
  "113": "Voevodskii, village Penza governorship in Saransk county. There is fair in late July; bring different petty merchants silk goods.",
  "63": "Borisov, a town in the Moscow Province Mozhaisk district. There is a one year yamarka 13 September, which attracts merchants from Vereya, Borovsky and Mozhdysk; bargaining for the most part is victuals and peasant different commodities like - something wheels, tar and the like.",
  "647": "SPAS on a hill in the village of Tver governorship Bezhetsky County. There is an annual fair, trade means bread, cattle, hides and tallow.",
  "564": "Pskov, the main town of this name governorship. In this city is the year two fairs, but in six county thereof.",
  "354": "Krolevec city Novogorodskogo - Seversky governorship. There is a three-year fair, and one of them is great.",
  "657": "Starinskiy, village Sinbirskogo governorship in Kurmysh district. There is Fair July 8th day.",
  "259": "Irbit, the city of Perm governorship. Here, every year in the month of January, half is a great fair that two or three weeks continues, this made for a great Foursquare living there courtyard, where the walls ninety-one, and even in the middle of the two rows of shops pyatdesyat osmium, and which occurs in the fair a real bargain, and even beyond that in addition to the courtyard seating thereof in many huts made of planks, while the victuals and different things sell",
  "666": "STYRNYANI, place Polotskogo governorship in Dinaburgsky County. In this place there are two fairs a year, of which trade on the Riga Palace of peasants different petty goods, wine and beer.",
  "519": "PEREKOPETS, a borough in the county of the city of Kharkiv. There is fair on March 9, May 6 and November 8, petty merchants traded goods, wine, beer, honey and other things.",
  "524": "Pernod, the city of Riga governorship. In the hold is the annual fair, three weeks after Midsummer, and lasts four weeks.",
  "704": "TUGLINSKAYA, Vologda Viceroyalty parish in the county town Yarensk. There are fairs: the first of January, from 6 to 17 days, the second in March from 25 April to 1 June and the third from 24 July to 1 September quarter from October 23 to 1. In these should come from different merchants Russian cities with goods, and buy the peasants still rustic proizrasteniya counties and crafts.",
  "149": "Gennady, a monastery in Yaroslavl governorship Lyubimsky County. When the hold each year on March 17 is fair.",
  "784": "SHULGINSK, place Yekaterinoslav region. In the hold of the year there are four fairs.",
  "438": "MOZHAYSKY, the city of Moscow Province. In the hold, except for the weekly Monday trading day, the fair is to present in this city ranks of June 29 days; on the judges come from nearby towns to him, from Tula, Kaluga, Borovsk and overlaid with different silk and other petty commodities.",
  "506": "OSTRAMEVO, Ryazan governorship village in the county of the city of Zaraysk. In this and the village is an annual fair one.",
  "59": "Epiphany, the fortress Yekaterinoslav region. In the case thereof, of the year three fairs.",
  "244": "Ivanovka settlement of Kharkov governorship and counties. There are fairs of January, 1, April 22, June 1 August, 1 September, 29 October; petty merchants traded goods, wine, beer, honey and other things.",
  "177": "Gruhn, town Chernigov governorship in Gadyatskaya County. In the hold is in year three fairs: the first week Cheese, the second day of the Descent of the Holy Spirit, the third on September 1, the day of St. Simeon. On the add different trade cattle, bread and victuals. There is also a weekly auction on Sunday for the most part bread.",
  "249": "Ivanovo, Kaluga governorship village near the town of Small Yaroslavets. There is an annual fair of the day on June 24, which brings together merchants from Small Yaroslavets from Borovskaa, peasant petty trade in goods.",
  "593": "RYZN, the village of the same district governorship in Kozelsk. There is an annual fair on the day of the Ascension; on the judges gathers merchants from the surrounding towns, Kaluga, Meshchovsk, Eagle, Volkhov Beleva and other cities; bring chandlery products, paper, silk, and other matter; but for the most part the county farmers bring different products, all bread, hemp, oil, honey, wax, Wax, sailing weft yarn, linen canvas, homespun and other peasant crafts and other petty commodities.",
  "701": "Troitsk, Moscow Province village in Zvenigorod district. It is fair on Pentecost day.",
  "106": "Veprik, town Chernigov Namestnichlstva in Gadyatskaya County. In the hold is in year three fairs: the first on May 9, the day of St. Nicholas, the second Avgusta29, on the day of the Beheading of St. John the Baptist, the third on November 21, the day of the entrance to the Church of Our Lady. Add-on trade cattle, fishes, various bread and other edibles. There is also ezhedelnoy auction on Sunday for the most part bread.",
  "232": "Zarubin, a village in the county of Irkutsk governorship of Kirensk. The fair takes place here in the month of June; merchants come from nearby cities with different petty goods; traded as horses, cattle, and other things.",
  "525": "Petrovka village Yekaterinoslav region s Poltava district. In the hold is kazhdonedelnoy bargaining roundabout residents of different victuals and drink.",
  "658": "bayou, since 1775, the city of Tver governorship. There are fairs twice a year: the first to the ninth week after Easter in the heel, the second in July before Ilyin day in heels same; sell different silk, paper, cloth and other goods.",
  "243": "Ivanovka village Penza governorship in Saransk county. There is an annual fair on July 8th Day; bring different petty merchants silk goods.",
  "150": "Germanova, settlement of the same governorship in Poshehonsky County. There is an annual fair in the fall of Nicholas Friday, and lasts two days.",
  "341": "Red KOLYADIN, town Chernigov Namestv Prilutskii County. In the hold is in year three fairs: the first on September 14, the day of the Exaltation of the Holy Cross, the second day of the Descent of the Holy Spirit, the third on December 6, the day of St. Nicholas. Add-on peddling their devious residents proizrasteniyami, like something bread, various cattle, victuals, wooden utensils, and other trifles.",
  "738": "Kherson, from 1784, the city of Yekaterinoslav region. Here Russian merchants from Constantinople Greeks and other European and Asian trade goods, receiving and releasing of the sea in ships.",
  "570": "PYATNITSKOE that Kolpin, a village in the county of Tula governorship Novosil city. In the village there is the hold twice Fair, in the ninth and tenth Friday after Easter; petty merchants sell different goods.",
  "198": "DRITSANY, place Polotskogo governorship in Dinaburgsky County. There are two fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "399": "Lutenko, town Chernigov governorship in Gadyatskaya County. In the hold is in year three fairs: the first day in the cutting off of the second on July 20, the day of St. Prophet Elijah, the third on November 1, the day of Cosmas and Damian. On the add ado residents sell bread, cattle and various edibles like - that fishes and salt.",
  "329": "Kostroma, the main town of this name governorship. There are povsyagodno in the ninth and tenth week after Easter fairs, and each week two trading days in Sereda and heels; comes to discharge the same for the most part the peasantry; brought from neighboring places canvas, yarn, bread and other peasant products.",
  "235": "Zemlyanskaya, the city of Voronezh governorship. In the district of the city, there are fairs a year in three villages; these should come to different cities of the Russian merchants with small goods.",
  "697": "Tresvyatskaya, Uren tozh, village Vyatsky governorship in the county town Tsarevosanchurska; here sezhayutsya bidding each year of January, 30 and 31, February 1, December 6 and 7 numbers merchants with all sorts of petty silk and paper products; also sell bread, honey, wax, and suhiya yalovochnye raw leather, sheepskin, fat, fish, bear and wolf skin, fox, marten, zayachiny, protein, and also horses.",
  "400": "Liadi, town of Mogilev governorship in Orsha district. Here is the year two fairs.",
  "87": "Belozerskaya city Novogorodskogo governorship. In the winter it happens every week on Mondays congress at which trades peasantry different domovnymi their products, also brought on me hay and grain.",
  "15": "Anaev, the village of Tambov governorship about Kadoma tenements; here is a fair of the year, who come from nearby merchants gorodovs silk, paper and other petty commodities.",
  "795": "language, the village Sinbirskogo governorship in Kurmysh district. It happens here in the day Genesis Fair Honest Trees; at the fair come from all sorts of silk and other goods from Moscow and other cities of the merchants, and peasants.",
  "120": "hi there, suburb of Kharkov governorship and counties. There are fair on September 6, October 14, December 9 of January, 27, March 9, May 11, July 24; petty merchants traded goods, wine, beer, honey and other things.",
  "161": "Gomel, Mogilev place governorship in Belitsk County. There can be two fairs a year.",
  "371": "Laish, the city of Kazan governorship. In the hold is fair in May from 6 June to 1 number for visitors to the Baroque caravans working people.",
  "286": "Kesova Gora, the village of the same vicariate and district. There is on the 24th day of June Fair, which the inhabitants of the county is brought all the food and other syreynye and edible products; and from other cities inhabitants come here with petty goods.",
  "624": "SEREVKA, a village in the county town of Rogachev. It happens in year four fairs.",
  "57": "Bogorodskaya, the city of Moscow Province. It happens in year two fairs: the first on May 9, the second on December 6, to which the peasants of the neighborhood brought different food, and petty merchants goods.",
  "105": "Venevsky Mykolaiv, Tula monastery governorship and counties. There is an annual fair of the day on August 15, which come with the goods from Tula, and Venev. from nearby villages.",
  "35": "Baturina place Novogorodskogo - Seversky governorship in Nezhin district. There is a four-year fair.",
  "526": "Petrovsky, the city of Yaroslavl governorship. It is at the bottom of the Year Fair: the first on July 29, and the second on September 14, which gathers near lying districts of the peasantry with different products and edibles.",
  "746": "Khrushchev, a village in the district governorship Ryazan city Donkova. There are two fairs a year: the first on May 9, the second day of August 16; these should come to the petty traders with different goods, also the peasantry.",
  "145": "Gadyach, the city of Chernigov governorship. In the case in the hold, four fairs: the first of January, 6, the day of St. Epiphany, the second on April 23, the day of St. George the, the third on June 29, the day of St. Peter and Paul, the fourth October 14, the day of Venerable Paraskeva . Add-on fairs and trade weekly trading days bread, honey, wax, tobacco, bacon, waves, hot wine, horses, cattle, sheep and other trifles.",
  "169": "Gorodnov or Gorodnitski, the city of Chernigov governorship. In the hold is in year two fairs: the first on June 29, the day of the Holy Apostles Peter and Paul, the second on October 14, the day of St. Paraskeva; to discharge the same and come Saturday ezhenedelnyetorzhki devious residents and Torguts bread, fishes, wood and pottery, ropes, lykami, sanmi and rims; also come from cities and Lavochne goods.",
  "414": "MAHONOVO, a village near the town of Tambov governorship Good. There is a year Fair on August 29; on the judges come to the petty traders in goods.",
  "610": "swinish, the monastery three miles from the city of Bryansk. There is every year on August 15 great fair, which lasts an entire month; on the judges attracts numerous merchants from distant places.",
  "404": "Macarena, the city of Nizhny Novgorod governorship. It happens at the monastery tamoshnem povsyagodno glorious Fair, starting from the day of St. Peter and St. Paul, and lasted three and four weeks. At the judges gathers a great variety of merchants from all over Russia and Siberia, also with Persian, Turkish and Polish borders.",
  "347": "Flint trench Yekaterinoslav region. In the case in the hold, four fairs.",
  "444": "Morshanskoye, the city of Tambov governorship. It is one of the year August 15 fair, where the local merchants sell one; besides winter from first to last way depart daily trading, which brought a considerable number of all kinds of bread.",
  "677": "TARNYANSKOY, town Kokshaisky quarter of the county town of Vaga. Sometimes the annual fair here, starting with 1 of January, and continues until 7 day of the month. Merchants come to discharge the same from nearby cities with different petty moskotilnymi and other goods.",
  "464": "Nevel, city Polotskogo governorship. There are four fairs a year: the first day of the Epiphany, the second in the first week of Lent, the third in heels before the day of the Prophet Elijah, the fourth day of December 6th.",
  "615": "Sebezh, since 1778, the city Polotskogo governorship. In this city, there s, four fairs: the first day of the Epiphany, the second in the first week of Lent, a third of August 1, the fourth day of April 23.",
  "273": "Kamenka settlement of Kharkov governorship in the county town of raisins. In the case thereof, of the year four fairs: the first day Alexis Man of God, the second day of Great Martyr George, third and fourth in the days of Nicholas summer and winter. On discharge the same merchants come from different Russian cities with silk, cotton, wool and other products.",
  "185": "DEYMANOVKA, the village of Chernihiv governorship in Prilutskii County. It happens here in the year two fairs, one-tenth of Friday and the other on July 2, the day of the honest robe of Our Lady, to whom the inhabitants of the village sell devious proizrasteniyami, such as bread, various cattle, victuals, wooden ware and other peasant trifle.",
  "642": "SALT-Vychegodskii since 1780, the city of Vologda Viceroyalty. In the hold is in year one fair; and the county thereof are trading in two villages in Bondokurskom camp and Ilinskom arrival on Vilyude.",
  "720": "USTIVITSA, place in Kiev Viceroyalty Myrgorod County. In the hold of the year is in excess of the weekly trading two fairs: the first on July 20, the second on October 26; traded on the add immigrants from different county residents petty goods, there Rodia, kak some bread, hot wine, various cattle, sheepskins, skins and so on. Sometimes the Great Russian merchants and come with a red item.",
  "577": "RZHITSA, place in Kiev Viceroyalty Lubensk County. In the hold there are two fairs a year: one on September 8, the other on November 21 numbers. Bargaining is imported from the counties of goods, kak some bacon, fishes, degshem, hot wine, nagodnymn sheepskin coats, beef hides, cattle, horses, baked bread, victuals and other petty commodities.",
  "686": "TESHEVSKOY, Orlovsky monastery governorship in Eletsky County. There is fair July 23 day; thereof on trade and oth Elets merchants of their cities with county townsfolk different petty goods and tar; and the townsfolk sold to merchants and their brothers horses, cattle, canvas, all sorts of edible supplies and needlework.",
  "527": "Petrovsky, the city of Saratov governorship. In this city, there is a yearly fair on July 8th day, but every week trading. two days Monday and heels; Bread sell other food, hay and firewood.",
  "792": "Yabluniv, place in Kiev Viceroyalty Lubenskiy County. In the hold of the year there are three fairs: the first day of the Lord cutting off the other day fair Beheading of St. John the Baptist, the third day of the Epiphany. The merchants of these should come to the near lying cities with red, Kramnoy and other goods, with glass and wooden utensils, with small villages of Don fishes; residents sell cattle horses, bread, tar, hot wine and so on. Also brought here for sale to residents Crimean salt.",
  "75": "Bryansk, Oryol city governorship. In this city, there was a fair in the month of June the tenth Friday after Easter; so near the city of swinish, starting from September, and continued to October.",
  "467": "Nyslott, the city of Vyborg governorship. In 1780 it established the annual Fair on September 15th.",
  "475": "Novosil, the city of Tula governorship. There is a fair one year on the day of cutting off; come from neighbors' cities with different petty merchants moskotilnymi and red goods.",
  "496": "Oposhnya, town Chernigov governorship in Gadyatskaya County. In the case in the hold, four fairs: the first week Fomin, the second in the tenth Friday, August 6th-thirds, on the day of the Transfiguration, the fourth October 29, the day of St. Demetrius; traded on the add different cattle, bread and victuals. There are weekly Torzhok on Monday and Friday, and trade more often bread.",
  "439": "Molvitino, a village near the suburb of Kostroma governorship Sudislavl. There is an annual fair on June 16 a day for which bargaining is built and shops.",
  "391": "Lukoml, place in Kiev Viceroyalty Lubenskiy County. There can be two fairs a year, one day the Prophet Elijah and the other on the day of the Archangel Michael. On the add fairs bargaining is imported from counties goods, as - that fat, fishes, tar, hot wine, nagolnymi sheepskin coats, beef hides, cattle, horses, baked bread and other edibles petty goods.",
  "528": "PETROVSKAYA fortress Yekaterinoslav region. In the case thereof, in the year six fairs.",
  "20": "Arzamas, a city of Nizhny Novgorod governorship. There usually is trading in week two days.",
  "715": "UNKOSOVA, village different Gentlemen Tambov governorship in Shatsky district. There is fair on the eleventh week after Easter on Friday, which sell hemp, canvas, wool and other things.",
  "619": "Semenovskoe, a village in the Yaroslavl governorship Poshehonsky County. There is an annual fair in the tenth Friday after Easter and lasts three days.",
  "454": "MURIKOVO, the village of Moscow Province in Volokolamsk district. Here is one of the year Fair Sept. 25 days; traded on various peasant products thereof.",
  "514": "Paphnutius, the monastery town of Kaluga governorship when Vorovsk. Beside this monastery there are annual fairs, the first Friday of the ninth, the other day on September 8, the feast of the Nativity of the Blessed Virgin Mary; these should come to the merchants of various cities with petty goods.",
  "654": "STALEROVCHIZNA, place Polotskogo governorship in Dinaburgsky County. In this place there in the year three fairs: trade Riga Palace petty peasants different goods, wine and beer.",
  "375": "Swan, the city of Kharkov governorship. In the hold town are in year three fairs: the first of January, 1, the day of circumcision, the second Passover in the tenth Friday tyaetiya September 20, the day of Saint Eustace. Merchants on these should come from the near lying cities Lavochne goods and hot wine.",
  "314": "KOKVINO, correct Kokovina, a small village of the Moscow province in the Dmitrov district; in it the churchyard S. Martyr George, that has a reputation in the Stables, sometimes after Easter Friday the tenth annual fair, which lasts only one day, on the way petty trade in goods.",
  "233": "Zashiversk, the city of the same governorship. There are fairs in December of January, and months.",
  "562": "Propoisk, town of Mogilev governorship. There are in addition to ordinary trading two fairs a year.",
  "112": "Vilyuiskaya upper and middle, cabin Irkutsk governorship. In the add are fair in September, October and November.",
  "745": "HOTMYSHSK, since 1780, the city of the same governorship. There are three fairs a year.",
  "460": "NABDIN, churchyard Pskov governorship in Velikiye County. There is an annual fair of the day on December 25, on the way from the townsfolk sold leather, linen, hemp, honey and other things like that; and from Velikiye, Toropetskiy Pskov merchants various small silk goods.",
  "101": "Velizh city Polotskogo governorship. In this city is the year two fairs: the first on July 20, the second in the first week of Lent.",
  "320": "Konotop city Novogorodskogo - Seversky governorship. It happens in year three fairs: the first August 15, the second on September 8, the third of November 21, but two Torzhok on koi collected from devious different cities and villages twice a week on Mondays and Fridays.",
  "451": "Mstislavl, the city of Mogilev governorship. In the case in the hold, the two fairs that come to bargain Jews, and sell various goods, kak some bread, cattle and peasant work different things.",
  "228": "Zhuravichi, town of Mogilev governorship in Starobyhovskom County. These merchants are going to four times a year at the fair.",
  "783": "Shokina, village Sinbirskogo governorship in Kurmysh district. In the hold is fair in the tenth Friday after Easter.",
  "397": "Ljubech town Chernigov governorship. In the hold is two fairs a year: the first on December 6, the day of St. Nicholas, the second day of the Ascension. Trades Islands in the add and congresses are sent daily imported from devious places Kramnoy small things, bread, pottery, skins, wheels to the other peasant goods",
  "163": "Brokeback, the city of Nizhny Novgorod governorship. It happens in Ceredo kazhdonedelno bargaining, where farmers bring bread and hemp.",
  "147": "GATNITSY, Pavshino tozh, a village in the county of Tula governorship city Alexina. In the hold are fair on July 8, at the Cheese week to Tuesday. Here merchants sell the right product to the peasants.",
  "671": "Sumy, since 1780, the city of the same governorship. In the hold fairs are: first, called Theodore, from the first week of Lent, and lasts two weeks and three and one on the Trinity week, the third day of the Assumption, the fourth Vvedenskaya, starting from 21 November, December and lasts through 6 and further . On discharge the same fair attracts various cities of the Russian merchants and Greeks; bring a good cloth, silk fabrics, brocade, different dishes, sugar, tea, wine, Russian leather and so on.",
  "55": "Bogoroditskaya, the village of the same district governorship in Aleksinskiy. In the hold is fair on July 8 on October 22; merchants sell goods necessary for the peasantry.",
  "531": "Petrom, a village in the Yaroslavl governorship Poshehonsky County. In the hold there are two annual fairs: the first Trinity, the second Ivanovo, that is, on September 26; these should come to the merchants of the neighbors' cities with different petty silk and other goods.",
  "470": "NOVOEZERSKOY Kirilov, the monastery Novogorodskogo governorship in the county town of Belozersk. There is an annual fair on March 17, called Alekseevskaya. It attracts different Russian cities bidding merchants.",
  "762": "CHERLYANKOVO, the village of Moscow Province in Volokolamsk district. Here is one of the year Fair May 9th day on which trading one day different peasant goods.",
  "575": "RASHEVKA, place in Kiev Viceroyalty Gadyatskaya County. In the hold there s two fairs a year: the first on May 9, the day of St. Nicholas, the other on September 1, the day of St. Simeon; beyond this there are bids every Sunday; trade fairs and discharge the same day the bread and victuals.",
  "766": "dill, town Chernigov governorship. It happens in year four fairs: the first day of the Holy Trinity, the other on August 15th, the third on December 6, the fourth of Lent in the fifth week; bargaining is imported from counties goods kak some bacon, fishes, tar hot wine, nagolnymi sheepskin coats, beef skins, baked bread, victuals and other petty commodities.",
  "427": "Miloslavichi, town of Mogilev governorship in Klimovitskiy County. In the hold is one annual fair.",
  "211": "Egorievskay back, a village on the Vologda Viceroyalty Kubeneokmu Zaozerye. On Sundays there is a weekly auction.",
  "276": "Karlivka, place Yekaterinoslav region. In the hold of the year there are three fairs.",
  "711": "Uglich, since 1777, the city of Yaroslavl governorship. There are two fairs: the first on July 8, three days, the second on December 26 numbers, one day; these should come to the merchants from Yaroslavl, Kashin and Pereslavl-Zaleski with silk, paper, moskotilnymi and other goods; and from the county gathers peasants with linseed and cartilage vym canvas with myasami, skins and fat. And in the county thereof are annual Torzhok in eleven villages, and fair in four, namely: Priluki, Rozhestvene, Kay and Nekouz; trade visitors from Uglich, Kashin and small merchants Bezhetsk moskotilnymi and silk goods; samizh buy bread, canvas, yarn, wool and woolen cloth, oil, and in the winter pork and beef meat, skin and fat fighting.",
  "481": "charm, the city of Kursk governorship. In the hold is in year five fairs: the first week Cheese on Friday in a second day of cutting off, a third of August 1, the fourth on September 8, the fifth December 6 numbers; to discharge the same for the most part the villagers brought bread, sesame oil and the like.",
  "793": "Yagotin, place the same governorship in Pereyaslav district. In the case in the hold, four fairs: the first in a commendable Saturday, the second day of Great Martyr George, the third day of the Transfiguration, the fourth day of the Archangel Michael. Merchants come from near lying cities with red, Kramnoy and other goods, glass and wooden utensils, victuals; residents sell cattle, horses, bread, tar, hot wine and so on. Also brought here for sale to residents Crimean salt.",
  "307": "Kodinsk, Ufa governorship village in the Chelyabinsk district. In the hold are fair on July 8th of January, and 6, of which bargaining is made petty commodities.",
  "254": "Izmailovo, a village in the Nizhny Novgorod governorship Arsamazskom County. In the hold is one in Mr. Du Fair.",
  "757": "CHENBAR, since 1780, the city of Penza governorship. In the hold is in the tenth year the fair on Friday after Easter; merchants come from near lying cities with inexpensive goods.",
  "406": "raspberry, village Moscow province. in the Kolomna district. In it every week on Tuesdays is bargaining bread and rustic wooden tableware products.",
  "469": "Nesterovskoye, trench Ekaterinoslavskogo Namestnichestvavoskresnym leaps and trade more peasant goods, bread and taverns supplies.",
  "408": "SMALL Yaroslavets, the city of Kaluga governorship. There are annual fair on April 23, May 9, November 26, December 6 and the tenth Friday after Easter, which came merchants from Borovsk and Vereya Serpukhov with silk and paper handkerchiefs, cotton material, vyboykami, tea, sugar, and kofiem moskotilnymi different goods; and the main part of this auction are local residents who bring food and rural products.",
  "773": "Chuhloma, since 1778, the city of Kostroma governorship. Beside thereof ten miles distance from the parish church of Barbara on December 4 is crowded fair way to the exclusion of other products, Merchants buy different furs, raw leather and sheepskin. A ten miles distance from the town of the same at the monastery Priory Abram, there are three fairs a year: the first on the first Sunday of the Ascension, the second Passover in the ninth Friday, the third day of October 1. Merchants come to these fairs from different Russian cities with silk, Shchepetina, silver and other goods.",
  "442": "Monastyrshchina, town of Mogilev governorship. It is a fair of the year.",
  "304": "Kobylyakov, place Yekaterinoslav region in the Poltava district. In the case in the hold, four fairs.",
  "393": "Luh, the city of Kostroma governorship. The county thereof with paternal Nicholas Monastery Tikhonovoj desert has Fair June 16 date, which brings different cities merchant silk and other goods.",
  "535": "Pisarevka, settlement near the town of the Free. In thereof is six fairs: the first day in the cutting off of the second on June 29, the third on September 8, the fourth on November 23, the fifth December 9, the sixth in a cheese week. The merchants of these should come to the near lying cities and trade cloth, silk, paper and naboychatymi goods, cloth, iron and other",
  "497": "edges, paternal different Gentlemen Tambov governorship in Shatsky district. There is a fair year on July 8; sell various goods like - that hemp, canvas different honey, bacon and other things.",
  "342": "Krasnokamensk, trench Yekaterinoslav region. In the hold is in year three fairs.",
  "251": "Ivica, Sloboda Kursk governorship in Korochensky County. In the case thereof, of the year two fairs: the first",
  "362": "KUMZERSKAYA, parish and county Vologda Viceroyalty. There is an annual fair, but only petty trade in goods.",
  "523": "PERM, the main town of this name governorship. In it, apart from the weekly on Sundays speculations are in year three fairs: the first on June 29, the second on September 20, the third 24 November.",
  "338": "KRASNOHORSKA, desert Tambov governorship in the county town Lebedyan. Here at Presbrazhenskom maiden monastery is one annual fair.",
  "340": "Red, village and county Kostroma governorship. There is an annual fair in Lreytsyn day, which built and shops.",
  "326": "Korop city Novogorodskogo - Seversky governorship. There are three fairs a year: the first week of the Publican and the Pharisee, the second of the descent of the Holy Spirit, the third day of September 20; these should come to the fair Great Russian and Little Russian merchants with various petty goods",
  "70": "Borowski, the city of Kaluga governorship. There was here in two fairs: the first on the tenth Friday after Easter Sunday, the second day of the Nativity of the Virgin of September 8; these should come to the merchants from Tula, Kaluga, Serpukhov and other cities; bring. silk and other goods, and for the most part peasants come from the canvas and other peasant products.",
  "268": "Kadoma, suburb of Tambov governorship. In the hold is in year two fairs: the first on June 29, the second on July 20; to discharge the same merchants come from nearby cities with silk, paper and tsrochimi petty goods.",
  "474": "Novonikolsk, Samodurovka tozh, Ryazan governorship village in the county town of boots. It happens in the hold annual fair in the ninth Friday after Easter; petty trading different commodities.",
  "151": "Gzhat, the city of Smolensk governorship. In this city, there is an annual fair, over kazhdonedelnyh trading, July 8 days; and in the villages is Congress in temple festivals, and each one only one day.",
  "443": "MOROMSK or MOROMESK, town and county of Kiev governorship. It is one of the year on December 6 Fair.",
  "731": "Florovit, the village of the same vicariate and district. In this and the village are trade conventions on June 23 and August 18 numbers.",
  "291": "Kirilov, city Novogorodskogo governorship. It is an annual fair on March 17 the day, called Alekseevskaya.",
  "626": "SEREDA STRATILATSKAYA, the village of Moscow Province in Volokolamsk district. There is an annual fair on June 8th Day.",
  "484": "Odoev, the city of the same governorship. In the hold is three fairs a year: in the tenth, eleventh and twelfth Friday to Easter, which in addition to wooden utensils and petty moskotilnogo product did not bring.",
  "622": "Serdobol, from 1784, the city of Vyborg governorship. In the hold has long annual fair takes place in the month of January, to which, in addition to Rossian, attracts Russian and Swedish Finns and Karelians with the skins of martens, otters, norek, lynx and others.",
  "357": "KRYLEEVO, place in Kiev Viceroyalty Pereiaslavl County. There are three fairs a year: the first on May 9, the second on August 15, third day of November 8; traded on the add different: petty goods, glass and wooden utensils and imported from the Don Cossack villages finely fishes. Residents sell cattle, horses, bread, tar, hot wine and other; also brought here for sale to residents Crimean salt.",
  "542": "POGROMTSA, Sloboda, Voronezh governorship in the county town Valuek. There is a five-year trade fairs.",
  "691": "TIKHONOVA, desert Kaluga governorship and counties. There is an annual fair on June 18 the day on which sezhayutsya merchants from Kaluga and Small Yaroslavets.",
  "726": "consolation, Village of Kaluga governorship in Kozelsk district. Here is the weekly auction on Sundays; to the bargaining comes merchants Kaluga and Orel Provinces of Bolhova and Beleva and other cities; bring products moskotilnye, some paper, silk and other varieties of fabrics; but for the most part and county farmers deliver different county goods, any bread, hemp, oil, honey, wax, Wax, sailing weft yarn, canvas, linen, homespun and other peasant and other petty handicraft products.",
  "466": "Nedrigayliv, the city of Kharkov governorship. In the hold are fair: the first 8 September, the second on October 29, the third of December 6 in the fourth day of cutting off. Kunz come to discharge the same from the surrounding cities with petty goods.",
  "213": "ELATMA, the city of Tambov governorship. There are kazhdonedelno Saturday Torzhok, which brought food and petty goods and people from outside Elatomsky inhabitants.",
  "696": "Toropets, since 1777, the city of Pskov governorship. It happens in one year ukaznoy Fair in July in heels, before the feast of the Prophet Elijah, which for the most part come peasants from nearby villages with peasant petty commodity and crafts.",
  "706": "Turkish-third, or parish in the county Vologda Viceroyalty Yarensk city. There is Fair Feb. 15 days for the month of March; buy here merchants mostly harvested and brought here by peasants fish.",
  "508": "island, town of Mogilev governorship in Sennoy County. There is a fair of the year.",
  "794": "Yadrin, from 1781, the city of Kazan governorship. In the hold city and county fairs there, and there are small Torzhok in each week for one day; product is a peasant, and overseas goods in the drive does not happen.",
  "261": "ISA, a village in the Saratov governorship and counties. In the hold, in excess of the weekly auctions; Fair is August 1 day traders on the judges brought silk products and other petty.",
  "723": "Ustiug GREAT, from the same year, the city of the same governorship. It is fair July 8th day of Procopius Ustyug Miracle Worker, which are for the most part Veliko Ustiug County farmers with their priugotovleniya.",
  "154": "Glinski, the city of Chernigov governorship. In the hold is in year two fairs: the first of September 1, the second week of Pentecost. Trades produce fishes, salt, hot wine, skins, sheepskins, cattle, horses and other petty commodities.",
  "183": "Dalmatia, the city of Perm governorship. It as a spring, May 9, and in the winter of December 6, that is, on the Feast of the Miracle Worker No hollow, is a great fair, which lasts until the 13th of December the same, and sometimes more; on the judges come from merchants lying near the Siberian city. And this fair Especially multiplied by the decline in the former Kataysk prison, not far from there lies, fairs, in the vicinity of Bashkortostan, on which the judges a lot of cattle and horses for sale fetches.",
  "221": "EREMENTSOVO, village and county Yaroslavl governorship. There is an annual fair in October Intercession on day 1 and week Torzhok on Tuesdays. The judges on the fair merchant people come from Yaroslavl, Romanova, Uglich, from Borisoglebsk, from fish and from different villages with petty peasants to sell goods, and with moskotilnymi and others, and in Torzhok weekly farmers sell bread.",
  "111": "Lappeenranta, a city of Vyborg governorship. In this city is the year twice Fair: 8 Pervan, and the second on August 29th of the month.",
  "569": "Pushan, place Polotskogo governorship in the county town Dinaburga. In this place there are three fairs a year; petty trade different products, wine and beer.",
  "599": "SAVIN Storozhevsky, Monastery, Moscow province. When the hold is fair on the tenth Friday, lasting several days.",
  "559": "rotten, place the same governorship and counties. In this place there are three fairs a year. Riga Palace also sell various petty peasants goods, wine and beer.",
  "47": "Bobrovytsia, town and county of Kiev governorship. In the hold town is in year two fairs.",
  "241": "battlements, the city of Tver governorship. In this city, there are annual fairs: the first to the tenth Friday after Easter, the second on July 20, the day of the Prophet Elijah, the third on August 6, the day of the Transfiguration, the fourth August 15, the day of the Assumption, the fifth December 6, the sixth May 9, the day of the Miracle Worker Nicholas, the seventh of January, 7, the day of John the Baptist, on Eighth Cheese week on Wednesday; trade in the surrounding towns merchants - silk, paper and other petty commodities, and most of victuals.",
  "629": "Serpukhov, since 1782, the city of Moscow Province. In the hold is in year two fairs: the first on the tenth Friday, the second day of September 15, beyond the ordinary trading.",
  "365": "KURENKI, place in Kiev Viceroyalty Lubenskiy County. There is year three fairs: the first on February 2, the other on June 29, the third 26 October numbers.",
  "461": "Narva city St. Petersburg province It has to put in the Swedish institutions have two fairs a year, in February and Iyulemesyatsah, every fourteen days.",
  "215": "ELIMSKOY, churchyard Pskov governorship in the county town of the island. There is fair in the month of June; merchants on the judges come from Pskov with various petty goods.",
  "522": "Pereiaslavl, the city of Kiev governorship. In the hold of the year there are fairs: the first of January, 6, the day of the Epiphany, the second to the tenth Friday after Easter, the third of September 1 Simeon; merchants come from near lying cities with red, Kramnoy, cloth and other goods; and the inhabitants of those places sell cattle, horses, bread, tar, hot wine and more.",
  "764": "Chernigov, 1782 with the main town of this name governorship. In the case in the hold, four fairs: the first is called procs-fievskaya, July 8; the second is called Evstafievskaya, September 20; tert-called Epiphany, of January, with the number 7, and continue for each week, and the fourth exit after Easter Sunday in the tenth Friday. Traded on the add many different goods arriving from the Great Russian and Little Russian cities merchants for the most part Ros-sian products; merchant sends the same city, and thence proizrasteniya brought in by the fairs Needlework different Russian cities in considerable quantity, and especially the rivers Dnieper and Desna.",
  "551": "PONORNITSA, town Chernigov governorship and counties. In the hold is in year two fairs: the first on April 23, the second on September 8 numbers; traded on the add and weekly auctions visitors from nearby cities petty merchants of goods and devious residents tutoshny growth and crafts, as - that wooden utensils, non-aqueous threads, also cattle and other edibles.",
  "8": "Alatyr city Sinbirskogo governorship. In the district of the city, there are seven annual fairs.",
  "97": "Varva, town Chernigov governorship in Prilutskii County. In the hold is in year three fairs: the first on May 9, the second on June 29, third day of November 1. On these or sell their devious residents proizrasteniyami like - that bread, various cattle, victuals, hay, tar and other petty; takzhebyvaet here and weekly auction on Wednesday.",
  "605": "Saratov, the main town of this name governorship. It is fair numbers from July 8th Congress of the peasants from nearby villages to sell and buy things they need, boleezh come Kalmyks for sale Kalmyk horses, koi they sell rubles to 16 and more, there are high growth, and walk amble; oui Rossian same Kalmyks buy bread among other things, a more cloth and silk fabrics for dressing their wives.",
  "53": "Bogodukhov, the city of Kharkov governorship. In the hold is in year six fairs: the first week Cheese on the second post on the laudable week, the third to the Ascension, the fourth 20 July, 29 August fifth, sixth, November 8. The merchants come to discharge the same from different Russian cities; bring silk goods, brocade, gold and silver braids in the case; traded as cattle, horses and other things.",
  "303": "KOBYZCHA, town and county of Kiev governorship. Zdez happens in year three fairs that sezzhaetya merchants from lying near Little Russian cities, and is selling fine Lavochne product, mulled wine, fish, salt, various breads, and other livestock.",
  "313": "Kozlovsky, fortress Yekaterinoslav region. In the case thereof, of the year four fairs.",
  "380": "estuary, suburb of Kharkov governorship in the county town of raisins. In the case thereof, of the year four fairs: the first on St. Thomas week, the second on July 8, the day of Procopius, the third on October 1, the day of the Intercession of the Virgin, the fourth on November 1, the day of Cosmas and Damian. Merchants come to discharge the same fair from different Russian cities with silk, cotton, wool and other goods.",
  "798": "Yampil, Sloboda G. Neplueff, Chernigov governorship in Nezhin district. In thereof are in year two fairs: On October 1, the second on April 23.",
  "635": "Skopina, since 1778, the city of Ryazan governorship. There is fair after Easter week in the ninth, tenth, and in vtoruyunadesyat Friday; goods imported from other cities and counties of the peasant, and other edible that narrow-minded peasant needs to belong.",
  "592": "Ryzhkov, a village in the Kaluga governorship Borovsky district. There is an annual fair of the day on August 15, the feast of the Assumption of the Blessed Virgin; merchants come with a variety of goods from different cities.",
  "532": "Peter and Paul, Trench Yekaterinoslav region. In the hold is in year four fairs.",
  "176": "Gritchin, village Tulskagu governorship in Kashira district. There is fair on the day of Pentecost; and on the toe fair goods on sale are brought from Kashira and near izTuly, Serpukhov, and Venepa Zaraysk on a small number of petty moskotilnoy and other edibles, and more than the inhabitants of the county for sale is hemp, honey, wax and other wooden products.",
  "770": "CHIGIRIN-Dubrova, a place in Kiev Viceroyalty Lubenskiy uezde.Zdes happens in year three fairs: the first day of Great Martyr George, the other on the day of the Prophet Elijah, the third day of the celebration of St. Paraskeva.",
  "100": "Veidelevka, Sloboda, Voronezh governorship in the county town Valuek. In the case thereof, of the year three fairs.",
  "298": "KIASOVKA, the village of Moscow Province in Kolomna district. It happens on Sundays kazhdonedelno bargaining on any sell bread and wooden utensils.",
  "420": "Meghri churchyard Olonets region in the county town of Vytegra. There is an annual fair on Christmas Day, trade Lavochne thereof on goods, but most of the soft stuff, for which merchants come from different Russian cities, including St. Petersburg from.",
  "364": "Kupenko, suburb of Kharkov governorship in the county town of raisins. There is a four-year fair: the first to the tenth Friday, September 8 at the second day of the Nativity of the Virgin, the third of December 9 on the day of the Conception of Anna, on the fourth Cheese week, these should merchants come from different cities with silk, cotton, wool and other goods.",
  "3": "Avdulova, Ivanovo tozh, a village in the Ryazan governorship Donkovskom County, where one is the annual fair on the day of St. John the Warrior, that is, on July 30, which came merchants and peasants with petty goods.",
  "576": "Volodimer Rzhev, Tver city governorship. In the hold there each year two fairs: one week of Lent in the Orthodox Church, the other day on June 29; products bring different moskotilnye, silk, braids Gold and silver, damask, brocade, grezeti, taffeta and other petty paper, and bread and various peasant products.",
  "175": "Gremyach, place Novogorodskogo - Seversky governorship in Starodubovskom County. In the hold there kazhdonedelnye Torzhok, which attracts residents devious and petty trading different commodities.",
  "448": "MOTSYNA, place Polotskogo governorship in the county town Dinaburga. In this place there are three fairs a year; Riga Palace peasants sell various petty goods, wine and beer.",
  "675": "SYAMSKOY, Monastery Vologda Viceroyalty and counties. When the hold is in the monastery, the three fairs, where merchants sell Vologda different petty goods."
}